
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Шахматка(Команда)	
	ОткрытьФорму("Отчет.Шахматка.Форма.ФормаОтчета", , ЭтотОбъект);	
КонецПроцедуры

&НаКлиенте
Процедура ПодборОН(Команда)
	ОткрытьФорму("Отчет.Квартирограмма.Форма.ФормаПодбора", , ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОтчетПоВзаимодействиям(Команда)
	ОткрытьФорму("Отчет.ОтчетПоВзаимодействиям.Форма", , ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОтчетПоИсточникамРекламы(Команда)
	ОткрытьФорму("Отчет.ОтчетПоИсточникамРекламы.Форма", , ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОтчетПоЗаявкамНаЗвонок(Команда)
	ОткрытьФорму("Отчет.ОтчетПоЗаявкамНаЗвонок.Форма", , ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции



#КонецОбласти