
&НаКлиенте
Процедура АктуализироватьКомплекты(Команда)
	
	АктуализироватьКомплектыНаСервере();
	Сообщить("Актуализация завершена");
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура АктуализироватьКомплектыНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НоменклатураКомплектующие.Ссылка,
	|	МАКСИМУМ(НоменклатураКомплектующие.Номенклатура.Актуальная) КАК НоменклатураАктуальная,
	|	НоменклатураКомплектующие.Ссылка.Актуальная
	|ИЗ
	|	Справочник.Номенклатура.Комплектующие КАК НоменклатураКомплектующие
	|
	|СГРУППИРОВАТЬ ПО
	|	НоменклатураКомплектующие.Ссылка,
	|	НоменклатураКомплектующие.Ссылка.Актуальная
	|
	|ИМЕЮЩИЕ
	|	МАКСИМУМ(НоменклатураКомплектующие.Номенклатура.Актуальная) <> НоменклатураКомплектующие.Ссылка.Актуальная";
	
	Запрос.УстановитьПараметр("", );
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			СпрОбъект 				= Выборка.Ссылка.ПолучитьОбъект();
			СпрОбъект.Актуальная 	= Выборка.НоменклатураАктуальная;
			
			Попытка
				СпрОбъект.Записать();
				Сообщить("Успешно актуализирован комплект: """ + Выборка.Ссылка + """");
			Исключение
				Сообщить("Не удалось актуализировать комплект: """ + Выборка.Ссылка + """");
			    Сообщить(ОписаниеОшибки(), СтатусСообщения.Внимание);
			КонецПопытки;
			
		КонецЦикла;  
		
	КонецЕсли; 
	
КонецПроцедуры

