
&НаКлиенте
Процедура ПолучениеЗаявокНаCallBack(Команда)
	УправлениеЗаявкамиНаЗвонок.ПолучениеЗаявокНаCallBack();
КонецПроцедуры

&НаКлиенте
Процедура ПолучениеЗаявокНаОбратныйЗвонок(Команда)
	//Тест();
	УправлениеЗаявкамиНаЗвонок.ПолучениеЗаявокНаОбратныйЗвонок();	
КонецПроцедуры

Процедура Тест()
	
	ПараметрыЗадания = Новый Массив;
	ФоновыеЗадания.Выполнить("УправлениеЗаявкамиНаЗвонок.ПолучениеЗаявокНаОбратныйЗвонок",
		ПараметрыЗадания,
		"УправлениеЗаявкамиНаЗвонок.ПолучениеЗаявокНаОбратныйЗвонок",
		"УправлениеЗаявкамиНаЗвонок.ПолучениеЗаявокНаОбратныйЗвонок");
		
КонецПроцедуры

&НаКлиенте
Процедура ПолучениеЗаявокСПочты(Команда)
	УправлениеЗаявкамиНаЗвонок.ПолучениеЗаявокСПочты();
КонецПроцедуры

&НаКлиенте
Процедура СозданиеЗаявокНаЗвонокИзВзаимодействий(Команда)
	УправлениеЗаявкамиНаЗвонок.СозданиеЗаявокНаЗвонокИзВзаимодействий();
КонецПроцедуры

&НаКлиенте
Процедура Автораспределение(Команда)
	УправлениеЗаявкамиНаЗвонок.АвтоРаспределениеЗаявок();
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеЗаявок(Команда)
	ОткрытьФорму("Обработка.УправлениеРаспределениемЗаявок.Форма.Форма", , ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаЗаявокНаЗвонокПоПлановомуВремени(Команда)
	УправлениеЗаявкамиНаЗвонок.ПроверкаЗаявокНаЗвонокПоПлановомуВремени();
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьЗаявкиCQНаСервере()
	УправлениеОбращениямиCQ.ЗагрузкаСобытийCQ_ЗаявкиНаЗвонок();
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьЗаявкиCQ(Команда)
	ЗагрузитьЗаявкиCQНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗагрузкаЗаявокДомКликНаСервере()
	УправлениеЗаявкамиНаЗвонок.ЗагрузкаЗаявокДомКлик();	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузкаЗаявокДомКлик(Команда)
	ЗагрузкаЗаявокДомКликНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьПисьмаCQНаСервере()
	УправлениеОбращениямиCQ.ЗагрузкаСобытийCQ_ЭлектронныеПисьма();
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьПисьмаCQ(Команда)
	ЗагрузитьПисьмаCQНаСервере();
КонецПроцедуры



	