
&НаСервере
Процедура ОбъектНедвижимостиПриИзмененииНаСервере()
	Объект.ВидНедвижимости = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ОбъектНедвижимости, "ВидНедвижимости");
КонецПроцедуры

&НаКлиенте
Процедура ОбъектНедвижимостиПриИзменении(Элемент)
	ОбъектНедвижимостиПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ЗаДату.Доступность = НЕ Объект.ЗагружатьЗаТекущийДень;
	Элементы.ГруппаCQ.Видимость = Объект.ПодключенCQ;
	
КонецПроцедуры

&НаСервере
Процедура ЗагружатьЗаТекущийДеньПриИзмененииНаСервере()
	
	Элементы.ЗаДату.Доступность = НЕ Объект.ЗагружатьЗаТекущийДень;
	Объект.ЗаДату = ?(Объект.ЗагружатьЗаТекущийДень, Дата(1,1,1), ТекущаяДата());

КонецПроцедуры

&НаКлиенте
Процедура ЗагружатьЗаТекущийДеньПриИзменении(Элемент)
	ЗагружатьЗаТекущийДеньПриИзмененииНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура ПодключенCQПриИзменении(Элемент)
	Элементы.ГруппаCQ.Видимость = Объект.ПодключенCQ;
КонецПроцедуры

