
&НаСервереБезКонтекста
Процедура ОбновитьНумерациюВстречНаСервере()
	ОбновитьНумерациюОбъектов(Метаданные.Документы.Встреча);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНумерациюВстреч(Команда)
	ОбновитьНумерациюВстречНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОбновитьНумерациюНаСервере()
	ОбновитьНумерациюОбъектов(Метаданные.Документы.Запрос);
	ОбновитьНумерациюОбъектов(Метаданные.Документы.ЗаявкаНаСделку);
	ОбновитьНумерациюОбъектов(Метаданные.Документы.ТелефонныйЗвонок);
	ОбновитьНумерациюОбъектов(Метаданные.Документы.Встреча);
	ОбновитьНумерациюОбъектов(Метаданные.БизнесПроцессы.СогласованиеЗаявкиНаСделку);
	ОбновитьНумерациюОбъектов(Метаданные.Задачи.ЗадачаИсполнителя);
	//ОбновитьНумерациюОбъектов(Метаданные.Справочники.Сделки);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНумерацию(Команда)
	ОбновитьНумерациюНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОбновитьНумерациюЗвонкаНаСервере()
	ОбновитьНумерациюОбъектов(Метаданные.Документы.ТелефонныйЗвонок);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНумерациюЗвонка(Команда)
	ОбновитьНумерациюЗвонкаНаСервере();
КонецПроцедуры
