#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИмяФактораЗапроса 	= Параметры.ИмяФактораЗапроса;
	Заголовок 			= Параметры.ЗаголовокФормы;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОсновнаяТаблица.Ссылка КАК Ссылка	
	|ИЗ
	|	" + СокрЛП(Параметры.ТипПараметраПодбора) + "." + СокрЛП(Параметры.ИмяТаблицы) + " КАК ОсновнаяТаблица
	|   " + СокрЛП(Параметры.СекцияЗапросаГДЕ) + ";";
	
	Если ЗначениеЗаполнено(Параметры.ПараметрОтбора) Тогда
		Запрос.УстановитьПараметр("ПараметрОтбора", Параметры.ПараметрОтбора);
	КонецЕсли;

	СписокЭлементовСправочника.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	
	Если ТипЗнч(Параметры.МассивСсылок) <> Тип("Массив") Тогда Возврат КонецЕсли;
	
	Для каждого ЭлементМассива Из Параметры.МассивСсылок Цикл
	
		ЭлементСписка 			= СписокЭлементовСправочника.НайтиПоЗначению(ЭлементМассива);	
		ЭлементСписка.Пометка 	= Истина;
	
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗакончитьПодбор(Команда)
	
	Результат = Новый Структура("ИмяФактораЗапроса", ИмяФактораЗапроса);
	
	МассивРезультатаВыбора = Новый Массив;
	
	Для каждого ЭлементСпискаЗначений Из СписокЭлементовСправочника Цикл
		Если ЭлементСпискаЗначений.Пометка Тогда
			МассивРезультатаВыбора.Добавить(ЭлементСпискаЗначений.Значение);	
		КонецЕсли;	
	КонецЦикла;
	
	Закрыть();
	Результат.Вставить("МассивРезультатаВыбора", МассивРезультатаВыбора);
	ОповеститьОВыборе(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЭлементовСправочникаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СписокЭлементовСправочника[ВыбраннаяСтрока].Пометка = Не СписокЭлементовСправочника[ВыбраннаяСтрока].Пометка;
КонецПроцедуры

#КонецОбласти

