
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр КоэффициентыПлатежДоход
	Движения.КоэффициентыПлатежДоход.Записывать = Истина;
	Движения.КоэффициентыПлатежДоход.Очистить();
	Для Каждого ТекСтрокаТЧ Из ТЧ Цикл
		Движение = Движения.КоэффициентыПлатежДоход.Добавить();
		Движение.Период = ДатаРегистрации;
		Движение.Банк = ТекСтрокаТЧ.Банк;
		Движение.Коэффициент = ТекСтрокаТЧ.Коэффициент;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
