
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    // СтандартныеПодсистемы.ВерсионированиеОбъектов
    ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
    // Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
    
    Скидка = ЗначениеРеквизитаТекущихДанных(Элемент.ТекущиеДанные, "Ссылка");
    
    ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Состав,
                                                "Использовать", Не Скидка = Неопределено);
    ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Состав,
        "Ссылка", Скидка, ВидСравненияКомпоновкиДанных.Равно, "Отбор по скидке", Истина);
    
КонецПроцедуры

Функция ЗначениеРеквизитаТекущихДанных(ТекущиеДанные, ИмяРеквизита) 
    
    ЗначениеРеквизита = Неопределено;
    Если Не ТекущиеДанные = Неопределено Тогда 
        Если ТипЗнч(ТекущиеДанные) = Тип("ДанныеФормыСтруктура") или ТипЗнч(ТекущиеДанные) = Тип("ДанныеФормыЭлементКоллекции") Тогда 
            ТекущиеДанные.Свойство(ИмяРеквизита, ЗначениеРеквизита);
        ИначеЕсли ТипЗнч(ТекущиеДанные) = Тип("ТекущиеДанныеСписка") Тогда 
            Попытка
                ЗначениеРеквизита = ТекущиеДанные[ИмяРеквизита];
            Исключение
            КонецПопытки;
        КонецЕсли;
    КонецЕсли;
    Возврат ЗначениеРеквизита;
    
КонецФункции // ЗначениеРеквизитаТекущихДанных()
