
//////////////////////
//	СЛУЖЕБНЫЕ		//
//////////////////////

&НаСервере
Процедура УправлениеВидимостьюДоступностью()
	
	Если Объект.ВидСкидки = Перечисления.ВидыСкидок.Абсолютная Или Объект.ВидСкидки = Перечисления.ВидыСкидок.АбсолютнаяОтСтоимостиВО Тогда
		Элементы.РамкаГруппыРазмерСкидки.Заголовок	= "Величина скидки, " + Объект.Валюта.Наименование;
		Элементы.Валюта.Видимость			= Истина;
	ИначеЕсли Объект.ВидСкидки = Перечисления.ВидыСкидок.Относительная Тогда
		Элементы.РамкаГруппыРазмерСкидки.Заголовок	= "Величина скидки, %";
	Иначе
		Элементы.РамкаГруппыРазмерСкидки.Заголовок	= "Величина скидки";
	КонецЕсли;
	
	Если Объект.ВидСкидки	= Перечисления.ВидыСкидок.ЗадаетсяВДокументе Тогда
		Элементы.ПанельВеличиныСкидки.ТекущаяСтраница	= Элементы.СтраницаЗадаетсяВДокументе;
	Иначе
		Элементы.ПанельВеличиныСкидки.ТекущаяСтраница	= Элементы.СтраницаВеличинаСкидки;
	КонецЕсли;
	
	Если Объект.ВидСкидки = Перечисления.ВидыСкидок.Относительная Или Объект.ВидСкидки = Перечисления.ВидыСкидок.ЗадаетсяВДокументе Тогда
		Элементы.Валюта.Видимость			= Ложь;
	КонецЕсли;
    
    Элементы.БезУчетаСтоимостиОтделки.Видимость = Объект.ВидСкидки = Перечисления.ВидыСкидок.Относительная;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьВидимостьВкладокПанели()
	Если Объект.ВидСкидки =  Перечисления.ВидыСкидок.Комплексная Тогда 
		Элементы.Панель.ТекущаяСтраница = Элементы.СложнаяСкидка;
	Иначе	
		Элементы.Панель.ТекущаяСтраница = Элементы.ОбычнаяСкидка;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ВидСкидкиПриИзмененииНаСервере()
	Объект.РазмерСкидки = 0;
	Объект.Состав.Очистить();
    Если Объект.БезУчетаСтоимостиОтделки и Не Объект.ВидСкидки = Перечисления.ВидыСкидок.Относительная Тогда 
        Объект.БезУчетаСтоимостиОтделки = Ложь;
    КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьПустуСсылку()
	Возврат Справочники.ТипыСкидок.ПустаяСсылка();
КонецФункции	

&НаСервере
Процедура ОбновитьОписаниеВидаСкидки()
	//Если Объект.ВидСкидки = Перечисления.ВидыСкидок.Относительная Тогда 
	//    Если Не Объект.БезУчетаСтоимостиОтделки Тогда 
	//        Элементы.НадписьОписаниеВидаСкидки.Заголовок = "Сумма скидки[ОН] = (Цена по договору[ОН] * (Размер скидки / 100)) * Площадь[ОН]";
	//    Иначе
	//        Элементы.НадписьОписаниеВидаСкидки.Заголовок = "Сумма скидки[ОН] = ((Цена по договору[ОН] - Цена за 1м² отделки[ОН]) * (Размер скидки / 100)) * Площадь[ОН]"; 
	//    КонецЕсли;    
	//ИначеЕсли Объект.ВидСкидки = Перечисления.ВидыСкидок.Абсолютная Тогда 
	//	Элементы.НадписьОписаниеВидаСкидки.Заголовок = "Сумма скидки[ОН] = Размер скидки * Площадь[ОН]";
	//ИначеЕсли Объект.ВидСкидки = Перечисления.ВидыСкидок.АбсолютнаяОтСтоимостиВО Тогда 
	//	Элементы.НадписьОписаниеВидаСкидки.Заголовок = "Сумма скидки[ОН] = (Площадь[ОН] / Общая площадь) * Размер скидки";
	//ИначеЕсли Объект.ВидСкидки = Перечисления.ВидыСкидок.Комплексная Тогда 
	//	Элементы.НадписьОписаниеВидаСкидки.Заголовок = "Сумма скидки расчитывается последовательно";		
	//Иначе
	//	Элементы.НадписьОписаниеВидаСкидки.Заголовок = "Указывается в документе";
	//КонецЕсли;
КонецПроцедуры

 &НаСервере
Функция ЭтоКомплекснаяСкидкаВСоставеКоторойЕстьСсылкаНаЭтуСкидку(ВыбранноеЗначение)
	Скидка = ВыбранноеЗначение;
	Если Не Скидка = Неопределено и Скидка.ВидСкидки = Перечисления.ВидыСкидок.Комплексная Тогда 
		Возврат ПроверитьСоставНаВхождениеРекурсивнойСсылки(Скидка);
	Иначе Возврат Ложь;	КонецЕсли;
КонецФункции

 &НаСервере
Функция ПроверитьСоставНаВхождениеРекурсивнойСсылки(Скидка)
	Для Каждого СкидкаСостава из  Скидка.Состав Цикл 
		Если СкидкаСостава.Скидка = Объект.Ссылка Тогда 
			Возврат Истина;
		ИначеЕсли СкидкаСостава.Скидка.ВидСкидки = Перечисления.ВидыСкидок.Комплексная и ПроверитьСоставНаВхождениеРекурсивнойСсылки(СкидкаСостава.Скидка) Тогда 
			Возврат Истина;
		КонецЕсли;	
	КонецЦикла;
	Возврат Ложь;
КонецФункции		




//////////////////////////////////
//	ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ	//
//////////////////////////////////

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбработатьВидимостьВкладокПанели();
	УправлениеВидимостьюДоступностью();
	ОбновитьОписаниеВидаСкидки();
КонецПроцедуры

//////////////////////////////////////////
//	ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ	//
//////////////////////////////////////////

&НаКлиенте
Процедура ВидСкидкиПриИзменении(Элемент)
	ВидСкидкиПриИзмененииНаСервере();
	УправлениеВидимостьюДоступностью();
	ОбработатьВидимостьВкладокПанели();
	ОбновитьОписаниеВидаСкидки();
КонецПроцедуры

&НаКлиенте
Процедура СоставСкидкаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ВыбранноеЗначение = Объект.Ссылка Тогда 
		СтандартнаяОбработка = Ложь;
		Элемент = ПолучитьПустуСсылку();
		ВыбранноеЗначение = Элемент;
	ИначеЕсли ЭтоКомплекснаяСкидкаВСоставеКоторойЕстьСсылкаНаЭтуСкидку(ВыбранноеЗначение) Тогда
		СтандартнаяОбработка = Ложь;
		Элемент = ПолучитьПустуСсылку();
		ВыбранноеЗначение = Элемент;
	КонецЕсли;
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    // СтандартныеПодсистемы.ВерсионированиеОбъектов
    ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
    // Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

КонецПроцедуры


&НаКлиенте
Процедура БезУчетаСтоимостиОтделкиПриИзменении(Элемент)
    ОбновитьОписаниеВидаСкидки();
КонецПроцедуры

