
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Вставить содержимое обработчика.
	//ПараметрыФормы = Новый Структура("", );
	//ОткрытьФорму("Справочник.ОбъектыНедвижимости.ФормаСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	ПараметрыОткрываемойФормы = Новый Структура("Ключ, ОбъектНедвижимости, Заголовок", ПараметрКоманды, ПараметрКоманды, "Очередь бронирования по ОН: " + Строка(ПараметрКоманды));
	ОткрытьФорму("Справочник.ОбъектыНедвижимости.Форма.ФормаОчередиБронирования", ПараметрыОткрываемойФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);		
	
КонецПроцедуры
