
Процедура ПередЗаписью(Отказ)
	
	//<792882>, Басаргин (16.03.2018) {
	ЗначенияРеквизитовОбъекта = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "СтатусСделки, ПометкаУдаления, ДатаРасторженияСделки");
	Если (НЕ ЗначенияРеквизитовОбъекта.СтатусСделки = Перечисления.СтатусыСделокСправочник.Расторгнута И СтатусСделки = Перечисления.СтатусыСделокСправочник.Расторгнута)
		ИЛИ (СтатусСделки = Перечисления.СтатусыСделокСправочник.Расторгнута И НЕ ДатаРасторженияСделки = ЗначенияРеквизитовОбъекта.ДатаРасторженияСделки) Тогда
		ДополнительныеСвойства.Вставить("ОбновитьЗапросПриРасторженииСделки", Истина);
	КонецЕсли;
	//<792882> }
	
	//<828132>, Басаргин (22.06.2018) {
	Если НЕ ЭтоНовый() И ПометкаУдаления И НЕ ЗначенияРеквизитовОбъекта.ПометкаУдаления
		ИЛИ (ЗначенияРеквизитовОбъекта.СтатусСделки = Перечисления.СтатусыСделокСправочник.Расторгнута И НЕ СтатусСделки = Перечисления.СтатусыСделокСправочник.Расторгнута) Тогда
		ДополнительныеСвойства.Вставить("ВыполнитьУдалениеЗаписиСПересчетом", Истина);
		//РегистрыСведений.Взаимодействия.ВыполнитьУдалениеЗаписиСПересчетом(ЭтотОбъект.Ссылка);
	КонецЕсли;
	//<828132> }
		
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	//<792882>, Басаргин (16.03.2018) {
	Если Отказ Тогда Возврат; КонецЕсли;
	Если ДополнительныеСвойства.Свойство("ОбновитьЗапросПриРасторженииСделки") 
		И ДополнительныеСвойства.ОбновитьЗапросПриРасторженииСделки
		ИЛИ (ДополнительныеСвойства.Свойство("ВыполнитьУдалениеЗаписиСПересчетом") 
			И ДополнительныеСвойства.ВыполнитьУдалениеЗаписиСПересчетом) Тогда
		ПараметрыЗадания = Новый Массив;
		//<828132>, Басаргин (22.06.2018) {
		//ПараметрыЗадания.Добавить(ЗаявкаНаСделку);
		ПараметрыЗадания.Добавить(Ссылка);
		ПараметрыЗадания.Добавить(ДополнительныеСвойства.Свойство("ВыполнитьУдалениеЗаписиСПересчетом") И ДополнительныеСвойства.ВыполнитьУдалениеЗаписиСПересчетом);
		//<828132> }
		ФоновыеЗадания.Выполнить("CRMРаботаСЗаданиямиСервер.ОбновитьЗапросПриРасторженииСделки",
			ПараметрыЗадания,
			Ссылка.УникальныйИдентификатор(),
			"ОбновитьЗапросПриРасторженииСделки");			
	КонецЕсли;	
	//<792882> }
	
КонецПроцедуры
