
Процедура ПередЗаписью(Отказ)

	//<792882>, Басаргин (16.03.2018) {
	Если НЕ ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "СтатусСделки") = Перечисления.СтатусыСделокСправочник.Расторгнута
		И СтатусСделки = Перечисления.СтатусыСделокСправочник.Расторгнута Тогда
		ДополнительныеСвойства.Вставить("ОбновитьЗапросПриРасторженииСделки", Истина);	
	КонецЕсли;
	//<792882> }
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	//<792882>, Басаргин (16.03.2018) {
	Если НЕ Отказ 
		И ДополнительныеСвойства.Свойство("ОбновитьЗапросПриРасторженииСделки") 
		И ДополнительныеСвойства.ОбновитьЗапросПриРасторженииСделки Тогда
		ПараметрыЗадания = Новый Массив;
		ПараметрыЗадания.Добавить(ЗаявкаНаСделку);
		ФоновыеЗадания.Выполнить("CRMРаботаСЗаданиямиСервер.ОбновитьЗапросПриРасторженииСделки",
			ПараметрыЗадания,
			Ссылка.УникальныйИдентификатор(),
			"ОбновитьЗапросПриРасторженииСделки");			
	КонецЕсли;	
	//<792882> }
	
КонецПроцедуры
