
&НаКлиенте
Процедура ЗаполнитьСпрвочник(Команда)
	
	Ошибки = "";	
	ДанныеОбАгентах = ЗаявкиНаКредитRestAPI.ПолучитьДоступныхАгентов(ПараметрыAPI, , , , Ошибки);
	Если Ошибки = "" Тогда
		ЗаполнитьЗамещающихАгентов(ДанныеОбАгентах);			
	Иначе
		Сообщить("Ошибка при получении данных об агентах: " + Ошибки);
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗамещающихАгентов(ДанныеОбАгентах) 
	
	Для каждого Агент Из ДанныеОбАгентах Цикл
		Если НЕ ЗначениеЗаполнено(Справочники.ЗамещающиеАгенты.НайтиПоРеквизиту("email", СокрЛП(Агент.email))) И Найти(СокрЛП(Агент.email), "sberbank") Тогда //sberbank
			Попытка
				НовыйЭлемент = Справочники.ЗамещающиеАгенты.СоздатьЭлемент();
				ЗаполнитьЗначенияСвойств(НовыйЭлемент, Агент);
				НовыйЭлемент.РасширенноеРедактирование = Истина;
				НовыйЭлемент.Записать();
			Исключение
				Сообщить("Ошибка создания агента: " + ОписаниеОшибки());
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//test
	ПараметрыAPI = Справочники.ПараметрыПодключенияAPIИпотечныхБанков.НайтиПоНаименованию("Парлайн", Истина);
	
КонецПроцедуры
