
&НаКлиенте
Процедура ОК(Команда)
	ВладелецФормы.ДополнительныеРасходыОбработкаВыбора(ДополнительныеРасходы);
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура Настройки(Команда)
	ФормаНастроекВидовДопРасходов = ПолучитьФорму("РегистрСведений.ВидыДополнительныхРасходов.ФормаСписка");
	ФормаНастроекВидовДопРасходов.Открыть();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СформироватьКнопкиВидов();
КонецПроцедуры

&НаСервере
Процедура СформироватьКнопкиВидов()

	КоличествоРядов = 5;

	Кнопки = Новый Соответствие;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВидыДополнительныхРасходов.ВидДополнительныхРасходов КАК Представление
		|ИЗ
		|	РегистрСведений.ВидыДополнительныхРасходов КАК ВидыДополнительныхРасходов";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ВсегоЗначений = ВыборкаДетальныеЗаписи.Количество();
	
	Ряд = 1;
	i = 1;  	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Ряд = ?(Ряд>КоличествоРядов,1,Ряд);
		Наименование = ВыборкаДетальныеЗаписи.Представление;
		ДобавитьКнопку(Наименование, i, Кнопки, Ряд);
		Ряд=Ряд+1;
		i=i+1;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьКнопку(Наименование,ПорядковыйНомер, Кнопки, Ряд)

	ПрефиксКоманды = "КомандаВид";
	
	ИмяКоманды = ПрефиксКоманды + ПорядковыйНомер;
	НоваяКоманда = ЭтаФорма.Команды.Найти(ИмяКоманды) ;
	Если НоваяКоманда = Неопределено Тогда
		Попытка
			НоваяКоманда = ЭтаФорма.Команды.Добавить(ИмяКоманды);
		Исключение
			Возврат;
		КонецПопытки;
	КонецЕсли;
	
	НоваяКоманда.Действие = "Команда";
	        	
	ЭлементРодительСтр = "Родитель" + ПрефиксКоманды+ Ряд;
	ЭлементРодитель = Элементы.Найти(ЭлементРодительСтр);
	Если ЭлементРодитель = Неопределено Тогда
		  ЭлементРодитель = Элементы.Добавить(ЭлементРодительСтр, Тип("ГруппаФормы"),Элементы["Родитель" + ПрефиксКоманды]);
		  ЭлементРодитель.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		  ЭлементРодитель.Отображение = ОтображениеОбычнойГруппы.Нет;
		  ЭлементРодитель.ОтображатьЗаголовок = Ложь;
	КонецЕсли;
	

	НовыйЭлемент = Элементы.Добавить(ИмяКоманды, Тип("КнопкаФормы"),ЭлементРодитель);
	НовыйЭлемент.ИмяКоманды = ИмяКоманды;
	НовыйЭлемент.Заголовок = Наименование;
	ШиринаЗаголовка = Макс(СтрДлина(Наименование),1);
	ЧестнаяШирина = ШиринаЗаголовка*2 / Pow(ШиринаЗаголовка,0.3);
	НовыйЭлемент.Ширина = ?(Ширина=0, ЧестнаяШирина,Макс(ЧестнаяШирина,Ширина));
	НовыйЭлемент.РасширеннаяПодсказка.Заголовок = Наименование;
	НовыйЭлемент.ВысотаЗаголовка = 1;
	НовыйЭлемент.РастягиватьПоГоризонтали  = Ложь;
	НовыйЭлемент.Вид = ВидКнопкиФормы.Гиперссылка;
	                                              	
	НовыйЭлемент.АвтоМаксимальнаяШирина = Истина;
	                                              	
КонецПроцедуры


&НаКлиенте
Процедура Команда()
	Значение = ЭтаФорма.ТекущийЭлемент.Заголовок + ", ";
	Элементы.ДополнительныеРасходы.ВыделенныйТекст = Значение;
	ЭтаФорма.ТекущийЭлемент = Элементы.ДополнительныеРасходы;
КонецПроцедуры
