
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПрочитатьНастройки();
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	Если Модифицированность Тогда
		Если Вопрос("Настройки были изменены. Записать?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да тогда
			ЗаписатьНастройки(Отказ);
		Иначе
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти   

#Область ОбработчикиСобытийЭлементовФормы



#КонецОбласти   

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
		
	Отказ = Ложь;
	ЗаписатьНастройки(Отказ);
	Если Не Отказ Тогда
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти   

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПрочитатьНастройки()
	
	НастройкиТелефонии = УправлениеТелефониейСервер.ПолучитьНастройкиТелефонии();
	Если НЕ НастройкиТелефонии = Неопределено Тогда
		ЗаполнитьЗначенияСвойств(ЭтаФорма, НастройкиТелефонии);
	КонецЕсли;	
		
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНастройки(Отказ)
	
	Если ПроверитьЗаполнение() Тогда
		НастройкиТелефонии = УправлениеТелефониейСервер.ПолучитьНастройкиТелефонии();
		Если НЕ НастройкиТелефонии = Неопределено Тогда
			ЗаполнитьЗначенияСвойств(НастройкиТелефонии, ЭтаФорма);
			УправлениеТелефониейСервер.УстановитьНастройкиТелефонии(НастройкиТелефонии);		
			Модифицированность = Ложь;
		КонецЕсли;
	Иначе
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти  
