
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Если ПользователиКлиентСервер.ЭтоСеансВнешнегоПользователя() Тогда
		Отказ = Истина;
	КонецЕсли;
	
	//<590625>, Басаргин (21.12.2016) {
	Вопросы = Новый Массив;
	Фамилия = ПланыВидовХарактеристик.ВопросыДляАнкетирования.НайтиПоРеквизиту("ПараметрПечати", "#Ответ.Фамилия#");
	Если ЗначениеЗаполнено(Фамилия) Тогда
		Вопросы.Добавить(Фамилия);
	КонецЕсли;
	Имя = ПланыВидовХарактеристик.ВопросыДляАнкетирования.НайтиПоРеквизиту("ПараметрПечати", "#Ответ.Имя#");
	Если ЗначениеЗаполнено(Имя) Тогда
		Вопросы.Добавить(Имя);
	КонецЕсли;	
	Отчество = ПланыВидовХарактеристик.ВопросыДляАнкетирования.НайтиПоРеквизиту("ПараметрПечати", "#Ответ.Отчество#");
	Если ЗначениеЗаполнено(Отчество) Тогда
		Вопросы.Добавить(Отчество);
	КонецЕсли;	
	МобильныйТелефон = ПланыВидовХарактеристик.ВопросыДляАнкетирования.НайтиПоРеквизиту("ПараметрПечати", "#Ответ.МобильныйТелефон#");
	Если ЗначениеЗаполнено(МобильныйТелефон) Тогда
		Вопросы.Добавить(МобильныйТелефон);
	КонецЕсли;	
	ДомашнийТелефон = ПланыВидовХарактеристик.ВопросыДляАнкетирования.НайтиПоРеквизиту("ПараметрПечати", "#Ответ.ДомашнийТелефон#");
	Если ЗначениеЗаполнено(ДомашнийТелефон) Тогда
		Вопросы.Добавить(ДомашнийТелефон);
	КонецЕсли;	
	//Список.Параметры.УстановитьЗначениеПараметра("Вопросы", Вопросы);
	Список.Параметры.УстановитьЗначениеПараметра("Фамилия", Фамилия);
	Список.Параметры.УстановитьЗначениеПараметра("Имя", Имя);
	Список.Параметры.УстановитьЗначениеПараметра("Отчество", Отчество);
	Список.Параметры.УстановитьЗначениеПараметра("МобильныйТелефон", МобильныйТелефон);
	Список.Параметры.УстановитьЗначениеПараметра("ДомашнийТелефон", ДомашнийТелефон);
	//<590625> }
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	//Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("Документ.Анкета.Форма.ФормаДокументаWeb", Новый Структура("Ключ", ВыбраннаяСтрока));
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьАнкету(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ОткрытьФорму("Документ.Анкета.Форма.ФормаДокументаWeb", Новый Структура("Ключ",  Элементы.Список.ТекущаяСтрока));

КонецПроцедуры
#КонецОбласти
