
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.УсловияИпотечногоКредитования.Записывать = Истина;
	Движения.УсловияИпотечногоКредитования.Очистить();
	Для Каждого ТекСтрокаТЧ Из ТЧ Цикл
		Движение = Движения.УсловияИпотечногоКредитования.Добавить();
		Движение.Период = Дата;
		Движение.Банк = Банк;
		Движение.Проект = ТекСтрокаТЧ.Проект;
		Движение.Комиссия = ТекСтрокаТЧ.Комиссия;
		Движение.МаксимальныйРазмерКомиссии = ТекСтрокаТЧ.МаксимальныйРазмерКомиссии;
		Движение.МинимальныйРазмерКомиссии = ТекСтрокаТЧ.МинимальныйРазмерКомиссии;
		Движение.ДополнительныеРасходы = ТекСтрокаТЧ.ДополнительныеРасходы;
		Движение.ВидКредита = Справочники.ВидыКредитов.ИпотечныйКредит;
		Движение.Программа = ТекСтрокаТЧ.Программа;
		Движение.ТипОбъекта = ТекСтрокаТЧ.ТипОбъекта;
	КонецЦикла;
	
	
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	// регистр УсловияИпотечногоКредитования
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	
КонецПроцедуры
