
Функция РасчитатьПериодНачало(ПериодОкончание, ВидРасчетногоЗначения) Экспорт 
	
	Сутки = 60*60*24;
	Если ВидРасчетногоЗначения = Перечисления.ВидыПериодов.День Тогда 
        Возврат ПериодОкончание - Сутки; 
    ИначеЕсли ВидРасчетногоЗначения = Перечисления.ВидыПериодов.Неделя Тогда
        Возврат ПериодОкончание - Сутки * 7;
    ИначеЕсли ВидРасчетногоЗначения = Перечисления.ВидыПериодов.Месяц Тогда
        Возврат ДобавитьМесяц(ПериодОкончание, -1);
    ИначеЕсли ВидРасчетногоЗначения = Перечисления.ВидыПериодов.Квартал  Тогда
        Возврат ДобавитьМесяц(ПериодОкончание, -3);
    ИначеЕсли ВидРасчетногоЗначения = Перечисления.ВидыПериодов.Полугодие Тогда
        Возврат ДобавитьМесяц(ПериодОкончание, -6);
    ИначеЕсли ВидРасчетногоЗначения = 	Перечисления.ВидыПериодов.Год Тогда
        Возврат ДобавитьМесяц(ПериодОкончание, -12);
	КонецЕсли;
	
    Возврат НачалоДня(ПериодОкончание);
	
КонецФункции

Процедура ПередЗаписью(Отказ)
		
	Если Не ЗначениеЗаполнено(ВидПериода) Тогда
		ВидПериода = Перечисления.ВидыПериодов.Дата;
	КонецЕсли; 
	
	Если Не ЗначениеЗаполнено(ПериодНачало) Тогда
   		ПериодНачало = НачалоДня(ТекущаяДата()) 	
	КонецЕсли; 

	Если Не ЗначениеЗаполнено(ПериодОкончание) Тогда		
		ПериодОкончание = КонецДня(ТекущаяДата());	
	КонецЕсли; 
	
	Если НЕ ВидПериода = Перечисления.ВидыПериодов.Дата Тогда
		ПериодНачало = НачалоДня(РасчитатьПериодНачало(ПериодОкончание, ВидПериода));		
	КонецЕсли;
		
КонецПроцедуры
