
#Область ОбработчикиПодписокНаСобытия

// Заполняет реквизит Автор нового документа, являющегося источников для подписки УстановитьАвтораДокумента .
// 
// Параметры:
//	Источник - ДокументОбъект - документ с реквизитом Автор.
//	Отказ - см. в справочной информации по платформе
//	РежимЗаписи - см. в справочной информации по платформе
//	РежимПроведения - см. в справочной информации по платформе
//
Процедура УстановитьАвтораИОтветственногоДокументаПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Источник.ДополнительныеСвойства.Свойство("СистемноеПроведение") Тогда
		Возврат;
	КонецЕсли;	

	Если НЕ ЗначениеЗаполнено(Источник.Ссылка) Тогда
		Источник.Автор = Пользователи.АвторизованныйПользователь();
	КонецЕсли;

	Источник.Ответственный = Пользователи.АвторизованныйПользователь();
	
	//Если НЕ ЗначениеЗаполнено(Источник.Ссылка) И НЕ ЗначениеЗаполнено(Источник.Автор) Тогда
	//	Источник.Автор = Пользователи.АвторизованныйПользователь();
	//КонецЕсли;
	//
	//Если Источник.Автор = Справочники.Пользователи.Робот И Источник.ЭтоНовый() Тогда
	//	Источник.Ответственный = Неопределено;		
	//Иначе		
	//	Источник.Ответственный = Пользователи.АвторизованныйПользователь();
	//КонецЕсли;	
		
КонецПроцедуры

// Заполняет реквизит Автор нового документа, являющегося источников для подписки УстановитьАвтораДокумента .
// 
// Параметры:
//	Источник - ДокументОбъект - документ с реквизитом Автор.
//	Отказ - см. в справочной информации по платформе
//
Процедура УстановитьАвтораИОтветственногоСправочникаПередЗаписью(Источник, Отказ) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Источник.ДополнительныеСвойства.Свойство("СистемноеПроведение") Тогда
		Возврат;
	КонецЕсли;	

	Если НЕ ЗначениеЗаполнено(Источник.Ссылка) Тогда
		Источник.Автор = Пользователи.АвторизованныйПользователь();
	КонецЕсли;

	Источник.Ответственный = Пользователи.АвторизованныйПользователь();
		
КонецПроцедуры

#КонецОбласти
