
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
		
	//Если ТипЗнч(Данные) = Тип("ДокументСсылка.ВыдачаДисконтныхКарт") Тогда
	//	Ссылка = Данные;	
	//ИначеЕсли ТипЗнч(Данные) = Тип("ДокументОбъект.ВыдачаДисконтныхКарт") Тогда
	//	Ссылка = Данные.Ссылка;
	//ИначеЕсли ТипЗнч(Данные) = Тип("Структура") И Данные.Свойство("Ссылка") Тогда
	//	Ссылка = Данные.Ссылка;
	//Иначе
	//	Возврат;
	//КонецЕсли;
	
	//СтандартнаяОбработка = Ложь;	
	//Представление = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "НомерКарты");	
	
	Если ТипЗнч(Данные) = Тип("Структура") И Данные.Свойство("НомерДисконтнойКарты") Тогда
		СтандартнаяОбработка = Ложь;
		Представление = Данные.НомерДисконтнойКарты; //Лев(СтрЗаменить(Данные.НомерКарты, " ", ""), 4) + " " + Прав(СтрЗаменить(Данные.НомерКарты, " ", ""), СтрДлина(СтрЗаменить(Данные.НомерКарты, " ", "")) - 4);
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Поля.Добавить("НомерДисконтнойКарты");
	
КонецПроцедуры

