
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	АдресФайлаДоп = ПоместитьВоВременноеХранилище(ВернутьSetFielder());
	Если ЭтоАдресВременногоХранилища(АдресФайлаДоп) Тогда
		ИмяМакетаДопЛист = "Программа печати PDF анкет";	//test
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаписатьШаблонПечатнойФормы(АдресФайлаДоп)		
	Константы.SetFielder.Установить(Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(АдресФайлаДоп), Новый СжатиеДанных(9)));
КонецПроцедуры

&НаКлиенте
Процедура ИмяМакетаДопЛистНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьВыборФайлаДопЛист", ЭтотОбъект);
	НачатьПомещениеФайла(ОписаниеОповещения, , , Истина, УникальныйИдентификатор); 

КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборФайлаДопЛист(Результат, Адрес, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт
	
	Если Не Результат Тогда
		Возврат;
	КонецЕсли; 
	
	АдресФайлаДоп = Адрес;
	//ЧастиСтроки = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ВыбранноеИмяФайла, "\");
	//ИмяМакетаДопЛист = ?(ЧастиСтроки.Количество(), ЧастиСтроки[ЧастиСтроки.ВГраница()], "");
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВернутьSetFielder()		
	Возврат Константы.SetFielder.Получить().Получить();
КонецФункции

&НаКлиенте
Процедура Save(Команда)

	Если ЭтоАдресВременногоХранилища(АдресФайлаДоп) Тогда
		ЗаписатьШаблонПечатнойФормы(АдресФайлаДоп);
	КонецЕсли;
	
КонецПроцедуры
