
#Область ПрограммныйИнтерфейс

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	//<875412>, Басаргин (25.09.2018) {
	ВыполнитьПроверкиОН(Отказ);	
	//<875412> }
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ВыполнитьПроверкиОН(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОбъектыНедвижимости.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ОбъектыНедвижимости КАК ОбъектыНедвижимости
	|ГДЕ
	|	ОбъектыНедвижимости.Ссылка В(&СписокОбъектовНедвижимости)
	|	И НЕ ОбъектыНедвижимости.Реализация
	|	И НЕ ОбъектыНедвижимости.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтатусыОбъектовНедвижимостиСрезПоследних.ОбъектНедвижимости КАК ОбъектНедвижимости
	|ИЗ
	|	РегистрСведений.СтатусыОбъектовНедвижимости.СрезПоследних(, ОбъектНедвижимости В (&СписокОбъектовНедвижимости)) КАК СтатусыОбъектовНедвижимостиСрезПоследних
	|ГДЕ
	|	НЕ СтатусыОбъектовНедвижимостиСрезПоследних.Статус В (ЗНАЧЕНИЕ(Перечисление.СтатусыОбъектовНедвижимости.Свободен), ЗНАЧЕНИЕ(Перечисление.СтатусыОбъектовНедвижимости.Резерв), ЗНАЧЕНИЕ(Перечисление.СтатусыОбъектовНедвижимости.Забронирован))";
	
	Запрос.УстановитьПараметр("СписокОбъектовНедвижимости", ОбъектНедвижимости);
	
	РезультатПакет = Запрос.ВыполнитьПакет();
	
	Если НЕ РезультатПакет[0].Пустой() Тогда	
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Объект не реализуем!", Ссылка, "ОбъектНедвижимости", "Объект", Отказ);			
	КонецЕсли;	
	
	Если НЕ РезультатПакет[1].Пустой() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Объект не свободен/зарезервирован/забронирован", Ссылка, "ОбъектНедвижимости", "Объект", Отказ);						
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


