
Процедура ОбработкаПроведения(Отказ, Режим)

	Если ВидОперации = Перечисления.ВидыОперацийСтопФакторы.Отмена Тогда
		Если НЕ ЗначениеЗаполнено(ДокументОснование) Тогда
			Отказ=Истина;
			Возврат;
		КонецЕсли;
	СнятьАктивностьПредыдущих();
	Возврат;
	КонецЕсли;
	
	Набор = РегистрыСведений.СтопФакторыБанков.СоздатьНаборЗаписей();
	Набор.Отбор.Регистратор.Установить(Ссылка);
	Набор.Прочитать();

	Для Каждого ТекСтрокаУсловияКредитования Из УсловияКредитования Цикл
		Движение = Набор.Добавить();
		Движение.Период = ДатаРегистрации;
		Движение.ИпотечныйБанк = ИпотечныйБанк;
		Движение.УсловиеКредитования = ТекСтрокаУсловияКредитования.УсловиеКредитования;
		Движение.Значение = ТекСтрокаУсловияКредитования.Значение;
		Движение.Группа = ТекСтрокаУсловияКредитования.Группа;
		Движение.Активен = Истина;
	КонецЦикла;

	Набор.Записать();
	
КонецПроцедуры


Процедура СнятьАктивностьПредыдущих()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтопФакторыБанков.Период,
	|	СтопФакторыБанков.Регистратор,
	|	СтопФакторыБанков.НомерСтроки,
	|	СтопФакторыБанков.Активность,
	|	СтопФакторыБанков.ИпотечныйБанк,
	|	СтопФакторыБанков.УсловиеКредитования,
	|	СтопФакторыБанков.Значение,
	|	СтопФакторыБанков.Группа,
	|	СтопФакторыБанков.Активен
	|ИЗ
	|	РегистрСведений.СтопФакторыБанков КАК СтопФакторыБанков
	|ГДЕ
	|	СтопФакторыБанков.Регистратор = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументОснование);
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Набор = РегистрыСведений.СтопФакторыБанков.СоздатьНаборЗаписей();
	Набор.Отбор.Регистратор.Установить(Ссылка);
	Набор.Прочитать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Запись = Набор.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, ВыборкаДетальныеЗаписи,,"Регистратор, Период");		
		Запись.Активен = Ложь;
		Запись.Период = ДатаРегистрации;
	КонецЦикла;
	
	Набор.Записать();

	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.СтопФакторыБанков") Тогда
		// Заполнение шапки
		ВидОперации = Перечисления.ВидыОперацийСтопФакторы.Отмена;
		ИпотечныйБанк = ДанныеЗаполнения.ИпотечныйБанк;
		ДокументОснование = ДанныеЗаполнения.Ссылка;
		Для Каждого ТекСтрокаУсловияКредитования Из ДанныеЗаполнения.УсловияКредитования Цикл
			НоваяСтрока = УсловияКредитования.Добавить();
			НоваяСтрока.Группа = ТекСтрокаУсловияКредитования.Группа;
			НоваяСтрока.Значение = ТекСтрокаУсловияКредитования.Значение;
			НоваяСтрока.УсловиеКредитования = ТекСтрокаУсловияКредитования.УсловиеКредитования;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры
