
&НаКлиенте
Процедура ПроверкаСтатусовИпотечныхЗаявок_Регламентно(Команда)
	
	ПроверкаСтатусовИпотечныхЗаявок_РегламентноНаСервере();

КонецПроцедуры

&НаСервере
Процедура ПроверкаСтатусовИпотечныхЗаявок_РегламентноНаСервере() 
	
	МассивПараметров = Новый Массив;
	Задание = ФоновыеЗадания.Выполнить("ЗаявкиНаКредитRestAPI.ПроверкаСтатусовИпотечныхЗаявок_Регламентно", МассивПараметров, Строка(Новый УникальныйИдентификатор), "Проверка статусов ипотечных заявок регламентно");

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ВерсионированиеОбъектов") Тогда
		МодульВерсионированиеОбъектов = ОбщегоНазначения.ОбщийМодуль("ВерсионированиеОбъектов");
		МодульВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	//++ Юкаев Роман 20180426 (//811656
	Если Пользователи.РолиДоступны("Администрирование") Тогда
		Элементы.ФормаДокументИпотечнаяЗаявкаСоздать.Видимость = Истина;
	КонецЕсли;
	//-- Юкаев Роман 20180426
	
КонецПроцедуры
