
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	АдресФайла = ПолучитьНавигационнуюСсылку(Объект.Ссылка, "Макет");
	АдресФайлаПлашки = ПолучитьНавигационнуюСсылку(Объект.Ссылка, "Плашка");
	
КонецПроцедуры

&НаКлиенте
Процедура АдресФайлаПлашкиНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОписаниеОповещенияОЗавершении = Новый ОписаниеОповещения("ОписаниеОповещенияОЗавершении", ЭтотОбъект, Новый Структура("РеквизитФормы", "АдресФайлаПлашки"));
	НачатьПомещениеФайла(ОписаниеОповещенияОЗавершении, , , Истина, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура АдресФайлаНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОписаниеОповещенияОЗавершении = Новый ОписаниеОповещения("ОписаниеОповещенияОЗавершении", ЭтотОбъект, Новый Структура("РеквизитФормы", "АдресФайла"));
	НачатьПомещениеФайла(ОписаниеОповещенияОЗавершении, , , Истина, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ОписаниеОповещенияОЗавершении(Результат, Адрес, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт
	
	Если Не Результат Тогда
		Возврат;
	КонецЕсли;
	
	ЭтаФорма[ДополнительныеПараметры.РеквизитФормы] = Адрес;
	//АдресФайла = Адрес;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЭтоАдресВременногоХранилища(АдресФайла) Тогда
		ТекущийОбъект.Макет = Новый ХранилищеЗначения( ПолучитьИзВременногоХранилища(АдресФайла));
	КонецЕсли; 
	
	Если ЭтоАдресВременногоХранилища(АдресФайлаПлашки) Тогда
		ТекущийОбъект.Плашка = Новый ХранилищеЗначения( ПолучитьИзВременногоХранилища(АдресФайлаПлашки));
	КонецЕсли; 
		
КонецПроцедуры

