
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.Страницы.Видимость = НЕ Объект.ТолькоОтправкаПисем;
	Элементы.ГруппаПолучатели.Видимость = Объект.ТолькоОтправкаПисем;

КонецПроцедуры

&НаКлиенте
Процедура НастройкиПравДоступаПользователейОбъектДоступаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура НастройкиПравДоступаПользователейОбъектДоступаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ТолькоОтправкаПисемПриИзменении(Элемент)
	
	Элементы.Страницы.Видимость = НЕ Объект.ТолькоОтправкаПисем;
	Элементы.ГруппаПолучатели.Видимость = Объект.ТолькоОтправкаПисем;
	
КонецПроцедуры
