
&НаСервере
Процедура ИзменитьИспользованиеНаСервере()

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СобытияCQ.Ссылка КАК Ссылка,
	|	СобытияCQ.Включено КАК Включено
	|ИЗ
	|	Справочник.СобытияCQ КАК СобытияCQ
	|ГДЕ
	|	НЕ СобытияCQ.ПометкаУдаления";
				   
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			Объект = Выборка.Ссылка.ПолучитьОбъект();
			Объект.Включено = НЕ Выборка.Включено;
			Объект.Записать();		
		КонецЦикла;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьИспользование(Команда)
	ИзменитьИспользованиеНаСервере();
КонецПроцедуры
