
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Для каждого СтрокаТЧ Из ТекущийОбъект.РанжированиеБанков Цикл
		
		СтрокаТЧ.Порядок = СтрокаТЧ.НомерСтроки;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборБанков(Команда)
	
	ПараметрыФормыПодбора = Новый Структура("УИДФормыВладельца", ЭтаФорма.УникальныйИдентификатор);
	ОткрытьФорму("Документ.РанжированияБанковПоПроектам.Форма.ФормаПодбораБанков", ПараметрыФормыПодбора, Элементы.РанжированиеБанков);
	
КонецПроцедуры

&НаКлиенте
Процедура РанжированиеБанковОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ЭтоАдресВременногоХранилища(ВыбранноеЗначение) Тогда
		ЗагрузитьНаСервере(ВыбранноеЗначение);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНаСервере(Знач ВыбранноеЗначение)
		
	ТЗ_Банков = ПолучитьИзВременногоХранилища(ВыбранноеЗначение);
	
	Для каждого СтрокаТЗ Из ТЗ_Банков Цикл
		Если Объект.РанжированиеБанков.НайтиСтроки(Новый Структура("Банк", СтрокаТЗ.Банк)).Количество() > 0 Тогда
			Продолжить;	
		КонецЕсли;
		НоваяСтрока = Объект.РанжированиеБанков.Добавить();	
		НоваяСтрока.Банк = СтрокаТЗ.Банк;
	КонецЦикла;
	
КонецПроцедуры

