
Процедура ОбновлениеОтображения()
	
	Элементы.ШаблоныПечатныхФорм.Видимость = ЗначениеЗаполнено(Объект.Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПрочитатьНабор();
	ОбновлениеОтображения();
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ЭтотНабор = РеквизитФормыВЗначение("ШаблоныПечатныхФорм");
		й = 0;
		Для Каждого Стр из ЭтотНабор Цикл
			Если ЭтоАдресВременногоХранилища(ШаблоныПечатныхФорм[Стр.НомерСтроки].АдресХранилищаМакета) Тогда
				Стр.Макет = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(ШаблоныПечатныхФорм[Стр.НомерСтроки + й].АдресХранилищаМакета));
			КонецЕсли;
			й = й + 1;
		КонецЦикла;
		ЭтотНабор.Записать();
	КонецЕсли;
	ПрочитатьНабор();
	ОбновлениеОтображения();
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьНабор()
	
	ЭтотНабор = РеквизитФормыВЗначение("ШаблоныПечатныхФорм");
    ЭтотНабор.Отбор.Шаблон.Значение=Объект.Ссылка;
    ЭтотНабор.Отбор.Шаблон.Использование=Истина;
    ЭтотНабор.Прочитать();	
	ЗначениеВРеквизитФормы(ЭтотНабор,"ШаблоныПечатныхФорм");
	й = 0;
	Для Каждого Стр из ЭтотНабор Цикл
		ШаблоныПечатныхФорм[Стр.НомерСтроки + й].АдресХранилищаМакета = ПоместитьВоВременноеХранилище(Стр.Макет.Получить(), Новый УникальныйИдентификатор);
		й = й + 1;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ШаблоныПечатныхФормПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		Элемент.ТекущиеДанные.Период = ТекущаяДата();
		Элемент.ТекущиеДанные.Шаблон = Объект.Ссылка;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Реквизит1имяМакетаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущаяСтрока =  Элементы.ШаблоныПечатныхФорм.ТекущиеДанные;
	АдресФайла = "";
	ВыбранноеИмяФайла = "";
	ПараметрыДОП = Новый Структура;
	ПараметрыДОП.Вставить("ТекСтрока", ТекущаяСтрока);
	Оповещение = Новый ОписаниеОповещения("ПослеПомещенияФайла", ЭтотОбъект, ПараметрыДОП);
	Попытка
		НачатьПомещениеФайла(Оповещение, , , , Новый УникальныйИдентификатор);
	Исключение
		Отказ = Истина;
		Сообщить("Не удалось загрузить файл по причине: " + ОписаниеОшибки());
	КонецПопытки;

КонецПроцедуры

&НаКлиенте
Процедура ПослеПомещенияФайла(Результат, Адрес, ВыбранноеИмяФайла, Параметры) Экспорт
	
	Если Адрес <> Неопределено Тогда
		ТекСтрока = Параметры.ТекСтрока;
		АдресФайла = Адрес;
		Отказ = Ложь;
		ЧастиСтроки = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ВыбранноеИмяФайла, "\");
		ТекСтрока.ИмяМакета = ?(ЧастиСтроки.Количество(), ЧастиСтроки[ЧастиСтроки.ВГраница()], "");
		ТекСтрока.АдресХранилищаМакета = Адрес;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Реквизит1имяМакетаОткрытие(Элемент, СтандартнаяОбработка)
	
	ТекДанные = Элементы.ШаблоныПечатныхФорм.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ТекДанные.АдресХранилищаМакета) Тогда
		Возврат;
	КонецЕсли;
	ЧастиСтроки = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ТекДанные.ИмяМакета, ".");
	Расширение = ?(ЧастиСтроки.Количество()>1, ЧастиСтроки[ЧастиСтроки.ВГраница()], "dotx");
		
	СтандартнаяОбработка = Ложь;
	Если Найти(ВРег(Расширение), "DOTX") ИЛИ Найти(ВРег(Расширение), "DOC") Тогда
		ИмяФайла = ПолучитьИмяФайлаШаблона(ТекДанные.АдресХранилищаМакета, Расширение);
		Если ЗначениеЗаполнено(ИмяФайла) Тогда				
			WordApplication = Новый COMОбъект("Word.Application");			
			WordApplication.Application.Visible = Истина;
			WordApplication.Documents.Open(ИмяФайла,0, 0);
			WordApplication.WindowState = 2;
			WordApplication.WindowState = 1;
			WordApplication.Activate();
			ДобавитьОбработчик WordApplication.DocumentBeforeSave, ОбработкаСобытияДокумента;
		КонецЕсли;
	ИначеЕсли Найти(ВРег(Расширение), "XLS") ИЛИ Найти(ВРег(Расширение), "XLSX") Тогда
		ИмяФайла = ПолучитьИмяФайлаШаблона(ТекДанные.АдресХранилищаМакета, Расширение);
		Если ЗначениеЗаполнено(ИмяФайла) Тогда				
			ExcelApplication = Новый COMОбъект("Excel.Application");
			ExcelApplication.Application.Visible = Истина;
			Book = ExcelApplication.WorkBooks.Open(ИмяФайла);
			ExcelApplication.WindowState = -4140;			  
			ExcelApplication.WindowState = -4137;
			Book.Activate();
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаСобытияДокумента(Док, SaveAsUI, Cancel)  
	ИмяФайла = Док.FullName;
КонецПроцедуры 

&НаКлиенте
Функция ПолучитьИмяФайлаШаблона(АдресШаблона, Формат = "dotx")
	
	ИмяФайлаШаблона = "";
	Если ЭтоАдресВременногоХранилища(АдресШаблона) Тогда
		Макет = ВернутьШаблонПечатнойФормы(АдресШаблона);
		Если НЕ Макет = Неопределено Тогда 
			ИмяФайлаШаблона = ПолучитьИмяВременногоФайла(Формат);
			Попытка
				Макет.Записать(ИмяФайлаШаблона);
			Исключение		
			КонецПопытки;
		КонецЕсли; 
	КонецЕсли;
	
	Возврат ИмяФайлаШаблона;
	
КонецФункции

&НаСервереБезКонтекста
Функция ВернутьШаблонПечатнойФормы(АдресШаблона)		
	Возврат ПолучитьИзВременногоХранилища(АдресШаблона);
КонецФункции
