
&НаСервере
Процедура ОКНаСервере()
	
	ЗаявкаОбъект = Параметры.ЗаявкаНаЗвонок.ПолучитьОбъект();
	Если ЗначениеЗаполнено(Комментарий) Тогда
		ЗаявкаОбъект.reqText = ЗаявкаОбъект.reqText + Символы.ПС + Комментарий;	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Дата) Тогда
		ЗаявкаОбъект.ДатаРаспределения = НачалоДня(Дата);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПлановоеВремя) Тогда
		ЗаявкаОбъект.ПлановоеВремя = НачалоДня(?(ЗначениеЗаполнено(Дата), Дата, ТекущаяДата())) + (ПлановоеВремя - НачалоДня(ПлановоеВремя)); //ПлановоеВремя;
	КонецЕсли; 
		
	ЗаявкаОбъект.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	ОКНаСервере();
	Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Параметры.ЗаявкаНаЗвонок) Тогда
		Отказ = Истина;
		Возврат;	
	КонецЕсли;
	
	//ПлановоеВремя = ТекущаяДата();
	
КонецПроцедуры
