
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	АктивныеПользователи = Истина;
	АктивныеПользователиПриИзмененииНаСервере();
	
	ЗакрыватьПриВыборе = Истина;
	Если Параметры.Свойство("УправляемаяПередача") Тогда
		УправляемаяПередача = Параметры.УправляемаяПередача;
	КонецЕсли;   
	
КонецПроцедуры

#КонецОбласти   

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПользователиПриАктивизацииСтроки(Элемент)
	
	Если НЕ Элементы.Пользователи.ТекущаяСтрока = Неопределено И НЕ Элементы.Пользователи.Развернут(Элементы.Пользователи.ТекущаяСтрока) Тогда
		 Элементы.Пользователи.Развернуть(Элементы.Пользователи.ТекущаяСтрока);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПользователиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь; 
	ТекДанные = Элементы.Пользователи.ТекущиеДанные;
	Если НЕ ТекДанные = Неопределено Тогда
		Если ЗначениеЗаполнено(ТекДанные.НомерТелефона) Тогда 
			НомерДляПереадресации = ТекДанные.НомерТелефона;
			ОповеститьОВыборе(НомерДляПереадресации);
			//Закрыть();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АктивныеПользователиПриИзменении(Элемент)	
	
	АктивныеПользователиПриИзмененииНаСервере();	
	Элементы.Пользователи.Обновить();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПользователиПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)

	//ТолькоАктивныеПользователи = Неопределено;
	//	Настройки.ДополнительныеСвойства.Свойство("ТолькоАктивныеПользователи", ТолькоАктивныеПользователи);
	//
	//Если ТолькоАктивныеПользователи = Неопределено Тогда
	//	Возврат;
	//КонецЕсли;
	//
	//СтрокиСсылок = Строки.ПолучитьКлючи();
	//АктивныеПользователи = УправлениеТелефониейСервер.ПолучитьАктивныхПользователей();
	//
	//Для каждого Ссылка ИЗ СтрокиСсылок Цикл
	//	СтрокаДанных = Строки.Получить(Ссылка);
	//	Если НЕ АктивныеПользователи.Найти(Ссылка) = Неопределено Тогда
	//		СтрокаДанных.Данные.ИндексКартинки = 0;	
	//		СтрокаДанных.Оформление["Пользователь"].УстановитьЗначениеПараметра("ЦветФона", WebЦвета.БледноЗеленый);
	//	КонецЕсли;
	//КонецЦикла
	
КонецПроцедуры

&НаКлиенте
Процедура НомерДляПереадресацииОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	//Закрыть();
КонецПроцедуры

#КонецОбласти   

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)	
	ОповеститьОВыборе(НомерДляПереадресации);
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	НомерДляПереадресации = "";
	//ОповеститьОВыборе(НомерДляПереадресации);
	Закрыть();	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОбработкаЦифровыхКнопок(Команда)
	
	СтрЦифры = Сред(Команда.Имя, Найти(Команда.Имя,"_") + 1);
	Если ПустаяСтрока(СтрЦифры) Тогда
		Возврат;
	КонецЕсли;
	НажатаяЦифра = СтрЦифры;
	Если НажатаяЦифра=Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если НажатаяЦифра = "р" Тогда
		НажатаяЦифра = "#";
	ИначеЕсли НажатаяЦифра = "з" Тогда
		НажатаяЦифра = "*";
	КонецЕсли;
	НомерДляПереадресации = НомерДляПереадресации + НажатаяЦифра;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСтереть(Команда)
	НомерДляПереадресации = Лев(НомерДляПереадресации, СтрДлина(НомерДляПереадресации) - 1);
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтобразитьКнопки(Команда)
	ЭтаФорма.Элементы.ГруппаЦифрКнопок.Видимость = Не ЭтаФорма.Элементы.ГруппаЦифрКнопок.Видимость;
КонецПроцедуры

#КонецОбласти   

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура АктивныеПользователиПриИзмененииНаСервере()

	Пользователи.Параметры.УстановитьЗначениеПараметра("ТолькоАктивныеПользователи", АктивныеПользователи);
	Если АктивныеПользователи Тогда		
		Пользователи.Параметры.УстановитьЗначениеПараметра("АктивныеПользователи", УправлениеТелефониейСервер.ПолучитьАктивныхПользователей());
	Иначе
		Пользователи.Параметры.УстановитьЗначениеПараметра("АктивныеПользователи", Неопределено);	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти  
