
//EXTCODE Шумилин Сергей 18.04.2016 {{ ---> 494731
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Перем ДополнительныеПараметры;
	
	Если Параметры.Свойство("ДополнительныеПараметры", ДополнительныеПараметры) Тогда
            
        // Выключим стандартную обработку
        СтандартнаяОбработка = Ложь;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПричиныПодарки.Номенклатура КАК Номенклатура
		|ИЗ
		|	Справочник.Причины.Подарки КАК ПричиныПодарки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Причины.Объекты КАК ПричиныОбъекты
		|		ПО ПричиныПодарки.Ссылка = ПричиныОбъекты.Ссылка
		|			И ПричиныПодарки.КлючСтроки = ПричиныОбъекты.КлючСтроки
		|			И (ПричиныПодарки.КлючСтроки <> 0)
		|ГДЕ
		|	ПричиныПодарки.Ссылка = &Ссылка
		|	И ПричиныПодарки.Номенклатура.Наименование ПОДОБНО ""%"" + &ПараметрОтбора + ""%""
		|	И ПричиныПодарки.Актуален
		|	И (ПричиныОбъекты.Проект = &Проект
		|			ИЛИ ПричиныОбъекты.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка))";
		
		Запрос.УстановитьПараметр("Ссылка", 		ДополнительныеПараметры.Причина);
		Запрос.УстановитьПараметр("Проект", 		ДополнительныеПараметры.Проект);
		Запрос.УстановитьПараметр("ПараметрОтбора", ДополнительныеПараметры.ПараметрОтбора);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если НЕ РезультатЗапроса.Пустой() Тогда
			
			ДанныеВыбора = Новый СписокЗначений;
			
			Выборка = РезультатЗапроса.Выбрать();
			Пока Выборка.Следующий() Цикл
				ДанныеВыбора.Добавить(Выборка.Номенклатура);
			КонецЦикла;  
			
		КонецЕсли; 
		 
    КонецЕсли;	
	
КонецПроцедуры
//EXTCODE Шумилин Сергей 18.04.2016 <--- }} 
