
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

//<884837>, Басаргин (23.10.2018) {
&НаКлиенте
Процедура НаписатьSMSПоШаблону(Команда)

	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	Предмет = ТекущиеДанные.Предмет;
	
	Если НЕ ЗначениеЗаполнено(Предмет) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбран предмет взаимодействия. Отправка SMS невозможна.", , , "Предмет");	
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("ВидСообщения, Предмет");
	ПараметрыФормы.ВидСообщения = "СообщениеSMS";
	ПараметрыФормы.Предмет = Предмет;
	ОткрытьФорму("Справочник.ШаблоныСообщений.Форма.СформироватьСообщение", ПараметрыФормы, ЭтаФорма, УникальныйИдентификатор);
	
КонецПроцедуры
//<884837> }

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	СтандартныеПодсистемыСервер.УстановитьУсловноеОформлениеПоляДата(ЭтотОбъект, "Список.Дата", Элементы.Дата.Имя);
	
КонецПроцедуры

#КонецОбласти
