
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Дата = ТекущаяДата();
	ЗначениеВДанныеФормы(Параметры.ЗапросСсылка.ПолучитьОбъект(), Объект);
	ЗначениеВДанныеФормы(ПолучитьИзВременногоХранилища(Параметры.ЛистингАдрес), Листинг);
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры, , "ЗакрыватьПриВыборе, ЗакрыватьПриЗакрытииВладельца, КлючНазначенияИспользования, ТолькоПросмотр");	
		
	//Если _Листинг.Количество() Тогда
	//	Для каждого Строка Из _Листинг Цикл
	//		Строка.Блок = ПолучитьБлок(Строка.ОбъектНедвижимости, Строка.ОбъектСтроительства);	
	//	КонецЦикла;
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Печатать(Команда)
	
	Закрыть();
	ПечатьЗаявкиНаЭкскурсиюНаСервере(ТД, ?(Дата = Неопределено, Объект.Дата, Дата));
	ТД.Напечатать(РежимИспользованияДиалогаПечати.Использовать);
	
КонецПроцедуры

&НаСервере 
Процедура ЗаполнитьПараметрыПоОбъекту(ОбластьМакета) 

	//ОбластьМакета.Параметры.Дата = Объект.Дата;
	//ОбластьМакета.Параметры.МенеджерПоПродажам = Объект.Ответственный;
	//ОбластьМакета.Параметры.ФИО = Объект.Клиент.ФИО;
	//ОбластьМакета.Параметры.Телефон = Объект.Клиент.ОсновнойТелефон;
	
	//ОбластьМакета.Параметры.Объект = Объект.Проект;
	ОбластьМакета.Параметры.Фаза = Фазы;
		
	ОбластьМакета.Параметры.Однокомнтаные = ?(Объект.КоличествоКомнат_1, "☑", "☐");
	ОбластьМакета.Параметры.Двухкомнатные = ?(Объект.КоличествоКомнат_2, "☑", "☐");
	ОбластьМакета.Параметры.Трехкомнатные = ?(Объект.КоличествоКомнат_3, "☑", "☐");
	ОбластьМакета.Параметры.Четырехкомнатные = ?(Объект.КоличествоКомнат_4, "☑", "☐");

	ОбластьМакета.Параметры.Блок = ?(Объект.Блок, "☑", "☐");	
	ОбластьМакета.Параметры.Корпус = Корпуса;
	
	ОбластьМакета.Параметры.Монолит = ?(Объект.ТипДомаМонолит, "☑", "☐");;
	ОбластьМакета.Параметры.Панель = ?(Объект.ТипДомаПанель, "☑", "☐");
	
	ОбластьМакета.Параметры.СоставСемьи = Объект.СоставСемьи;
	ОбластьМакета.Параметры.ФакторыВыбора = ФакторыВыбора;
	ОбластьМакета.Параметры.СтопФакторы = СтопФакторы;
	ОбластьМакета.Параметры.ЦельПокупки = ЦельПокупки;
	
КонецПроцедуры

&НаСервере
Процедура ПечатьЗаявкиНаЭкскурсиюНаСервере(ТД, ДатаЭкскурсии)
	
	ТД.Очистить();
	
	ТД.АвтоМасштаб = Истина;
	ТД.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТД.ПолеСверху = 10;
	ТД.ПолеСнизу = 10;
	ТД.ПолеСлева = 8;
	ТД.ПолеСправа = 8;	
 	ТД.ЭкземпляровНаСтранице = 1;
	
	МакетЗаявкиНаЭкскурсию = Документы.Запрос.ПолучитьМакет("МакетЗаявкиНаЭкскурсию");
	
	ОбластьМакета = МакетЗаявкиНаЭкскурсию.ПолучитьОбласть("Шапка"); 
	КартинкаПроекта = ПолучитьКартинкуПроекта(Объект.Проект);
	ОбластьМакета.Рисунки.Логотип.Картинка = ?(ЗначениеЗаполнено(КартинкаПроекта), КартинкаПроекта, Новый Картинка);
	ТД.Вывести(ОбластьМакета);
	
	ОбластьМакета = МакетЗаявкиНаЭкскурсию.ПолучитьОбласть("ИнформацияПоОтветственному"); 
	ОбластьМакета.Параметры.Дата = ДатаЭкскурсии;//Объект.Дата;
	ОбластьМакета.Параметры.МенеджерПоПродажам = Объект.Ответственный;
	ОбластьМакета.Параметры.ФИО = Объект.Клиент.ФИО;
	ОбластьМакета.Параметры.Телефон = Объект.Клиент.ОсновнойТелефон;	
	ОбластьМакета.Параметры.ВидКлиента = Элементы.ВидКлиента.СписокВыбора[ВидКлиента].Представление;	
	ТД.Вывести(ОбластьМакета);
	
	ОбластьМакета = МакетЗаявкиНаЭкскурсию.ПолучитьОбласть("ЗаполнениеПараметров");	
	ЗаполнитьПараметрыПоОбъекту(ОбластьМакета);	
	ТД.Вывести(ОбластьМакета);	
	
	ОбластьМакета = МакетЗаявкиНаЭкскурсию.ПолучитьОбласть("ЛистингШапка");
	МассивОбластейДляПроверки = Новый Массив;
	МассивОбластейДляПроверки.Добавить(ОбластьМакета);				
	Если НЕ ТД.ПроверитьВывод(МассивОбластейДляПроверки) Тогда
		ТД.ВывестиГоризонтальныйРазделительСтраниц();
		ОбластьМакета = МакетЗаявкиНаЭкскурсию.ПолучитьОбласть("Шапка");
		ТД.Вывести(ОбластьМакета);
		ОбластьМакета = МакетЗаявкиНаЭкскурсию.ПолучитьОбласть("ЛистингШапка");
		ТД.Вывести(ОбластьМакета);
	Иначе
		ТД.Вывести(ОбластьМакета);
	КонецЕсли;
			
	Для каждого Строка Из Листинг Цикл	
		ОбластьСтрока = МакетЗаявкиНаЭкскурсию.ПолучитьОбласть("ЛистингСтрока");
		МассивОбластейДляПроверки = Новый Массив;
		МассивОбластейДляПроверки.Добавить(ОбластьМакета);				
		Если НЕ ТД.ПроверитьВывод(МассивОбластейДляПроверки) Тогда
			ТД.ВывестиГоризонтальныйРазделительСтраниц();
			ОбластьМакета = МакетЗаявкиНаЭкскурсию.ПолучитьОбласть("Шапка");
			ТД.Вывести(ОбластьМакета);
			ОбластьМакета = МакетЗаявкиНаЭкскурсию.ПолучитьОбласть("ЛистингСтрока");
			ТД.Вывести(ОбластьМакета);
		КонецЕсли;
		ОбластьСтрока.Параметры.ОбъектКорпус = "" + Строка(Строка.Проект) + "/" + Строка(Строка.ОбъектСтроительства);
		ОбластьСтрока.Параметры.Этаж = Строка(Строка.Этаж);
		ОбластьСтрока.Параметры.Комнаты = Строка(Строка.КоличествоКомнат);
		ОбластьСтрока.Параметры.Статус = Строка(Строка.Статус);
		ОбластьСтрока.Параметры.ВидМатериала = Строка(Строка.ВидМатериала);
		ОбластьСтрока.Параметры.ТипОтделки = ?(ЗначениеЗаполнено(Строка(Строка.ТипОтделки.СокращённоеНаименование)), Строка(Строка.ТипОтделки.СокращённоеНаименование), Строка(Строка.ТипОтделки));
		ОбластьСтрока.Параметры.Блок = Строка.Блок;		
		ОбластьСтрока.Параметры.НомерКвартиры = Строка(Строка.ОбъектНедвижимости);
		ОбластьСтрока.Параметры.СтроительныйНомер = Строка.СтроительныйНомер;
		ОбластьСтрока.Параметры.ПлощадьПроектная = Строка.ПлощадьПроектная;
		ОбластьСтрока.Параметры.Площадь = ?(ЗначениеЗаполнено(Строка.СтроительныйНомер), Строка.Площадь, 0);		
		ОбластьСтрока.Параметры.КомментарийЭкскурсовода = "";//Объект.Комментарий;		
		ТД.Вывести(ОбластьСтрока);
	КонецЦикла;
	
	//ОбластьМакета = МакетЗаявкиНаЭкскурсию.ПолучитьОбласть("ПропускСтроки");
	//ТД.Вывести(ОбластьМакета);	
	//
	//ОбластьМакета = МакетЗаявкиНаЭкскурсию.ПолучитьОбласть("ПодписьЭкскурсовода");
	//ТД.Вывести(ОбластьМакета);
	
	ПропускСтроки = МакетЗаявкиНаЭкскурсию.ПолучитьОбласть("ПропускСтроки");
	ТД.Вывести(ПропускСтроки);	
	
	ПодписьЭкскурсовода = МакетЗаявкиНаЭкскурсию.ПолучитьОбласть("ПодписьЭкскурсовода");
	ТД.Вывести(ПодписьЭкскурсовода);
		
	МассивОбластейДляПроверки = Новый Массив;
	МассивОбластейДляПроверки.Добавить(ПропускСтроки);
	МассивОбластейДляПроверки.Добавить(ПодписьЭкскурсовода);
	
	Пока ТД.ПроверитьВывод(МассивОбластейДляПроверки) Цикл
		ТД.Вывести(ПропускСтроки);
	КонецЦикла;
	
	МассивОбластейДляПроверки.Добавить(ПодписьЭкскурсовода);
	
	//ОбластьМакета = МакетЗаявкиНаЭкскурсию.ПолучитьОбласть("Подвал");
	//ТД.Вывести(ОбластьМакета);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьКартинкуПроекта(Проект)
	
	Попытка 
		Возврат Новый Картинка(Проект.Плашка.Получить());
	Исключение
	КонецПопытки;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьБлок(ОН, ОС)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Квартирограмма.Блок КАК Блок
	|ИЗ
	|	РегистрСведений.Квартирограмма КАК Квартирограмма
	|ГДЕ
	|	Квартирограмма.ОбъектНедвижимости = &ОбъектНедвижимости
	|	И Квартирограмма.ОбъектСтроительства = &ОбъектСтроительства";
	
	Запрос.УстановитьПараметр("ОбъектНедвижимости", ОН);
	Запрос.УстановитьПараметр("ОбъектСтроительства", ОС);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Блок;
	КонецЕсли;
	
КонецФункции
