
&НаКлиенте
Процедура АдресНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ВыполнитьВызовНаСервере();
		
КонецПроцедуры

&НаСервере
Процедура ВыполнитьВызовНаСервере()	
	
	//СтруктураЗаписи = Новый Структура;
	//СтруктураЗаписи.Вставить("Объект"       , Объект);
	//СтруктураЗаписи.Вставить("Тип"          , ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Адрес");
	//СтруктураЗаписи.Вставить("Вид"          , ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ФактАдресКонтрагента");
	//СтруктураЗаписи.Вставить("Представление", Объект.Адрес);
	//СтруктураЗаписи.Вставить("Комментарий"  , "");
	//
	//Для а = 1 По 10 Цикл
	//	СтруктураЗаписи.Вставить("Поле" + Строка(а), "");
	//КонецЦикла;
	//
	//Обработки.РедактированиеКонтактнойИнформации.Создать().РедактироватьЗапись(МенеджерЗаписи, Ложь);	
		
КонецПроцедуры
