
&НаКлиенте 
Перем ЗакрытиеФормы;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//МассивЭлементовКУдалению = Новый Массив;
	//Для Каждого ЭлементОтбора Из Список.КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
	//	Если ТипЗнч(ЭлементОтбора) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
	//		Для Каждого ЭлементГруппы Из ЭлементОтбора.Элементы Цикл
	//			ЭлементГруппы.Использование = Ложь;
	//		КонецЦикла;
	//	Иначе
	//		МассивЭлементовКУдалению.Добавить(ЭлементОтбора.ЛевоеЗначение);
	//	КонецЕсли;
	//КонецЦикла;
	//
	//Для каждого Настройка Из Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
	//	Если ТипЗнч(Настройка) = Тип("ОтборКомпоновкиДанных") Тогда
	//		Настройка.Элементы.Очистить();
	//	КонецЕсли;
	//КонецЦикла; 
	//
	//Для Каждого Элемент Из МассивЭлементовКУдалению Цикл
	//	ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(Список, Элемент);
	//КонецЦикла;
	
	Если Параметры.Свойство("КлючЗаписи") Тогда
		Элементы.Список.ТекущаяСтрока = Параметры.КлючЗаписи; 	
	КонецЕсли;
	
	Если Параметры.Свойство("МаркетинговаяКомпания") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "МаркетинговаяКампания", Параметры.МаркетинговаяКомпания, ВидСравненияКомпоновкиДанных.ВСписке, , Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);			
	КонецЕсли;

	Если Параметры.Свойство("Использована") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Использована", Параметры.Использована, ВидСравненияКомпоновкиДанных.Равно, , Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	КонецЕсли;
			
	Если Параметры.Свойство("Выгодоприобретатели") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Выгодоприобретатель", Параметры.Выгодоприобретатели, ВидСравненияКомпоновкиДанных.ВСписке, , Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);			
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если НЕ ЗавершениеРаботы Тогда
		Если ТипЗнч(ЗакрытиеФормы) = Тип("Булево") И ЗакрытиеФормы Тогда
  	  		Возврат;
		КонецЕсли;
		ТекущиеДанные = Элементы.Список.ТекущиеДанные;
		Если ТекущиеДанные = Неопределено Тогда
			Возврат;	
		КонецЕсли;	
		СтандартнаяОбработка = Ложь;
		ЗакрытиеФормы = Истина;
		Закрыть(Новый Структура("ДисконтаняКарта", Элементы.Список.ТекущаяСтрока));			
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
		
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	ЗакрытиеФормы = Истина;
	Закрыть(Новый Структура("ДисконтаняКарта", Элементы.Список.ТекущаяСтрока));
	
КонецПроцедуры

