
Процедура ВывестиФормуСозданияЗапланированногоВзаимодействияДляМенеджераФилиала(ФормаВзаимодействия, ПараметрыЗаписи) Экспорт

	Если ФормаВзаимодействия.Объект.Отменено
			ИЛИ НЕ ФормаВзаимодействия.Рассмотрено
			ИЛИ ФормаВзаимодействия.Объект.Ответственный <> ПользователиКлиентСервер.АвторизованныйПользователь()
			ИЛИ НЕ ПараметрыЗаписи.ИзменилсяПризнакРассмотрено 
			ИЛИ НЕ ПараметрыЗаписи.РольМенеджерФилиала
			ИЛИ НЕ ПараметрыЗаписи.СтатусЗапроса = ПредопределенноеЗначение("Перечисление.СтатусыЗапроса.ВРаботе") Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОткрываемойФормы = Новый Структура;
	
	ПараметрыОткрываемойФормы.Вставить("ЗапланированнаяВстреча", 		ПредопределенноеЗначение("Документ.Встреча.ПустаяСсылка"));
	ПараметрыОткрываемойФормы.Вставить("ЗапланированныйЗвонок",			ПредопределенноеЗначение("Документ.ТелефонныйЗвонок.ПустаяСсылка"));
	ПараметрыОткрываемойФормы.Вставить("ТекущаяВстреча", 				ПредопределенноеЗначение("Документ.Встреча.ПустаяСсылка"));
	ПараметрыОткрываемойФормы.Вставить("ТекущийЗвонок",					ПредопределенноеЗначение("Документ.ТелефонныйЗвонок.ПустаяСсылка"));		
	ПараметрыОткрываемойФормы.Вставить("ТекущееСобытие",				Ложь);
	ПараметрыОткрываемойФормы.Вставить("СтатусЗапроса",					ПараметрыЗаписи.СтатусЗапроса);
	ПараметрыОткрываемойФормы.Вставить("МассивКлиентов",				ПараметрыЗаписи.МассивКлиентов);
	ПараметрыОткрываемойФормы.Вставить("Основание", 					ФормаВзаимодействия.Предмет);
	
	ОткрытьФорму("Документ.Запрос.Форма.ФормаСозданияВзаимодействия", 	ПараметрыОткрываемойФормы, ФормаВзаимодействия,,,,,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);		

	ФормаВзаимодействия.АБ_ИзменилсяПризнакРассмотрено = Ложь;
	
КонецПроцедуры

