
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Не ЗначениеЗаполнено(Объект.НомерКарты) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указан номер карты", Объект.Ссылка, "НомерКарты", "Объект", Отказ);
	КонецЕсли;		
	
	Если Не ЗначениеЗаполнено(Объект.МаркетинговаяКампания) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указана маркетинговая кампания", Объект.Ссылка, "МаркетинговаяКампания", "Объект", Отказ);
	КонецЕсли;		
	
	Если Не ЗначениеЗаполнено(Объект.ДатаВыдачи) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указана Дата выдачи", Объект.Ссылка, "ДатаВыдачи", "Объект", Отказ);
	КонецЕсли;			
	
КонецПроцедуры

&НаКлиенте
Процедура МаркетинговаяКампанияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыОткрытияФормы = Новый Структура("ВыборИзДисконтнойКарты");	
	ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения("ПослеЗакрытияФормыВыбораМК", ЭтотОбъект);
	ОткрытьФорму("Справочник.МаркетинговыеКомпании.Форма.ФормаВыбораМК", ПараметрыОткрытияФормы, ЭтаФорма, , , , ОписаниеОповещенияОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияФормыВыбораМК(РезультатЗакрытия, ДополнительныеПараметры) Экспорт 
	
	Если РезультатЗакрытия = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.МаркетинговаяКампания = РезультатЗакрытия.МК;
	
КонецПроцедуры

