
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Параметры.Причина) Тогда
		Возврат;
	КонецЕсли;	
	
	СписокНоменклатуры = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПричиныПодарки.Номенклатура КАК Номенклатура
	|ИЗ
	|	Справочник.Причины.Подарки КАК ПричиныПодарки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Причины.Объекты КАК ПричиныОбъекты
	|		ПО ПричиныПодарки.КлючСтроки = ПричиныОбъекты.КлючСтроки
	|			И (ПричиныПодарки.КлючСтроки <> 0)
	|			И ПричиныПодарки.Ссылка = ПричиныОбъекты.Ссылка
	|ГДЕ
	|	ПричиныПодарки.Ссылка = &Ссылка
	|	И ПричиныПодарки.Номенклатура.Актуальная
	|	И ПричиныПодарки.Актуален
	|	И (ПричиныОбъекты.Проект = &Проект
	|			ИЛИ ПричиныОбъекты.Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка))";
	
	Запрос.УстановитьПараметр("Ссылка", Параметры.Причина);
	Запрос.УстановитьПараметр("Проект", Параметры.Проект);
	
	РезультатЗапроса 	= Запрос.Выполнить().Выгрузить();
	СписокНоменклатуры 	= РезультатЗапроса.ВыгрузитьКолонку("Номенклатура");
	
	Список.Параметры.УстановитьЗначениеПараметра("СписокСсылок", СписокНоменклатуры);	
	
КонецПроцедуры
