#Область ПрограммныйИнтерфейс

#КонецОбласти

#Область ОбработчикиПроведения

Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр СтатусыОбъектовНедвижимости
	Движения.СтатусыОбъектовНедвижимости.Записывать = Истина;
	Для Каждого ТекСтрокаСтатусыОбъектовНедвижимости Из СтатусыОбъектовНедвижимости Цикл
		Движение 						= Движения.СтатусыОбъектовНедвижимости.Добавить();
		Движение.Период 				= Дата;
		Движение.ОбъектНедвижимости 	= ТекСтрокаСтатусыОбъектовНедвижимости.ОбъектНедвижимости;
		Движение.Статус 				= ТекСтрокаСтатусыОбъектовНедвижимости.Статус;
		Движение.ДокументРегистратор 	= ПредставлениеДокументаУПН;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти



