
&НаКлиенте
Процедура ВыполнитьРассылку(Команда)
	ВыполнитьРассылкуНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВыполнитьРассылкуНаСервере()
	РегистрыСведений.РассылкаПоСогласованиюЗаявокНаСделку.РассылкаУведомленийПоСогласованиюЗаявокНаСделку();
КонецПроцедуры

&НаСервере
Процедура УведомитьИсполнителейОНовыхЗадачахНаСервере()
	БизнесПроцессыИЗадачиСервер.УведомитьИсполнителейОНовыхЗадачах();
КонецПроцедуры

&НаКлиенте
Процедура УведомитьИсполнителейОНовыхЗадачах(Команда)
	УведомитьИсполнителейОНовыхЗадачахНаСервере();
КонецПроцедуры



