
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если Данные.Свойство("Ссылка") И ТипЗнч(Данные.Ссылка) = Тип("СправочникСсылка.ПоляДополнительныхГруппировокЗаявокНаЗвонок") Тогда
		ПредставлениеПоля = Данные.Ссылка.ПредставлениеПоля; //ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Данные.Ссылка, "ПредставлениеПоля");
		Представление = ?(ПустаяСтрока(ПредставлениеПоля), ?(Данные.Свойство("Наименование"), Данные.Наименование, Строка(Данные.Ссылка)), ПредставлениеПоля);
	КонецЕсли;
	
КонецПроцедуры
