
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	АдресФайла = ПолучитьНавигационнуюСсылку(Объект.Ссылка, "Макет");
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЭтоАдресВременногоХранилища(АдресФайла) Тогда
		ТекущийОбъект.Макет = Новый ХранилищеЗначения( ПолучитьИзВременногоХранилища(АдресФайла));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОписаниеОповещенияОЗавершении(Результат, Адрес, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт
	
	Если Не Результат Тогда
		Возврат;
	КонецЕсли; 
	АдресФайла = Адрес;
	
КонецПроцедуры

&НаКлиенте
Процедура АдресФайлаНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОписаниеОповещенияОЗавершении = Новый ОписаниеОповещения("ОписаниеОповещенияОЗавершении", ЭтотОбъект);
	НачатьПомещениеФайла(ОписаниеОповещенияОЗавершении, , , Истина, УникальныйИдентификатор);
	
КонецПроцедуры
