
#Область ПрограммныйИнтерфейс

#КонецОбласти

#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СрокиБронированияОбъектовНедвижимости.Параметры.УстановитьЗначениеПараметра("ОбъектНедвижимостиВыделение", Параметры.ОбъектНедвижимости);
КонецПроцедуры

//++ Юкаев Роман 20180409 (//801763
&НаКлиенте
Процедура СрокиБронированияОбъектовНедвижимостиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	
	//ПараметрыФормы = Новый Структура("Регистратор", Элемент.ТекущиеДанные.Регистратор);
	//ОткрытьФорму("РегистрНакопления.ОчередьБронирования.ФормаСписка", Новый Структура("Отбор", ПараметрыФормы), ЭтаФорма, ЭтаФорма,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	Если ЗначениеЗаполнено(Элемент.ТекущиеДанные.Регистратор) Тогда
		ПоказатьЗначение(, Элемент.ТекущиеДанные.Регистратор);
	КонецЕсли;
	
КонецПроцедуры
//-- Юкаев Роман 20180409 )

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти


