
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПараметрыПримененияСтавок_Значения.Ссылка
		|ИЗ
		|	Справочник.ПараметрыПримененияСтавок_Значения КАК ПараметрыПримененияСтавок_Значения
		|ГДЕ
		|	НЕ ПараметрыПримененияСтавок_Значения.ПометкаУдаления
		|	И ПараметрыПримененияСтавок_Значения.Владелец = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ПараметрыПримененияСтавок.ТипОбъекта)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Элементы.ТЧТипОбъекта.СписокВыбора.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура ТЧДополнительныеРасходыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ФормаВвода = ПолучитьФорму("Документ.ВводУсловийИпотечногоКредитования.Форма.ФормаВводаМногострочногоЗначения",,ЭтаФорма);	
	ФормаВвода.ДополнительныеРасходы = Элементы.ТЧ.ТекущиеДанные.ДополнительныеРасходы;
	ФормаВвода.Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеРасходыОбработкаВыбора(ВыбранноеЗначение) Экспорт
	Элементы.ТЧ.ТекущиеДанные.ДополнительныеРасходы = ВыбранноеЗначение;
КонецПроцедуры
