
#Область ПрограммныйИнтерфейс

Процедура ОткрытьРабочуюПанельТелефонии() Экспорт
	
	ИмяПараметра = "Телефония.РабочаяПанельТелефонии";
	Если ПараметрыПриложения[ИмяПараметра] = Неопределено Тогда
		ИмяФормы = "Обработка.Телефония.Форма.РабочаяПанельТелефонии";
		ПараметрыПриложения.Вставить(ИмяПараметра, ПолучитьФорму(ИмяФормы, , , глТелефония["ИдентификаторФормыТелефонии"], ));  
	КонецЕсли;
	Форма = ПараметрыПриложения[ИмяПараметра];
	Если НЕ Форма = Неопределено Тогда
		Если Форма.Открыта() Тогда
			Форма.Активизировать();
		Иначе
			Форма.Открыть();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗакрытьРабочуюПанельТелефонии() Экспорт
	
	ИмяПараметра = "Телефония.РабочаяПанельТелефонии";
	Если ПараметрыПриложения[ИмяПараметра] = Неопределено Тогда
		ИмяФормы = "Обработка.Телефония.Форма.РабочаяПанельТелефонии";
		ПараметрыПриложения.Вставить(ИмяПараметра, ПолучитьФорму(ИмяФормы, , , глТелефония["ИдентификаторФормыТелефонии"], ));  
	КонецЕсли;
	Форма = ПараметрыПриложения[ИмяПараметра];
	Если НЕ Форма = Неопределено Тогда
		Если Форма.Открыта() Тогда
			Форма.Закрыть();
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

//Процедура ОткрытьКарточкуЗвонка() Экспорт
//	
//	ИмяПараметра = "Телефония.КарточкаЗвонка";
//	Если ПараметрыПриложения[ИмяПараметра] = Неопределено Тогда
//		ИмяФормы = "Обработка.Телефония.Форма.КарточкаЗвонка";
//		ПараметрыПриложения.Вставить(ИмяПараметра, ПолучитьФорму(ИмяФормы, , , , ));  
//	КонецЕсли;
//	Форма = ПараметрыПриложения[ИмяПараметра];
//	Если НЕ Форма = Неопределено Тогда
//		Если Форма.Открыта() Тогда
//			Форма.Активизировать();
//		Иначе
//			Форма.Открыть();
//		КонецЕсли;
//	КонецЕсли;
//	
//КонецПроцедуры

//Процедура ЗакрытьКарточкуЗвонка() Экспорт
//	
//	ИмяПараметра = "Телефония.КарточкаЗвонка";
//	Если ПараметрыПриложения[ИмяПараметра] = Неопределено Тогда
//		ИмяФормы = "Обработка.Телефония.Форма.КарточкаЗвонка";
//		ПараметрыПриложения.Вставить(ИмяПараметра, ПолучитьФорму(ИмяФормы, , , , ));  
//	КонецЕсли;
//	Форма = ПараметрыПриложения[ИмяПараметра];
//	Если НЕ Форма = Неопределено Тогда
//		Если Форма.Открыта() Тогда
//			Форма.Закрыть();
//		КонецЕсли;
//	КонецЕсли;	
//	
//КонецПроцедуры

Процедура ЗакэшироватьФормуТелефонии(Форма) Экспорт
	
	ИмяПараметра = "Телефония.РабочаяПанельТелефонии";
	Если ПараметрыПриложения[ИмяПараметра] = Неопределено Тогда
		ПараметрыПриложения.Вставить(ИмяПараметра, Форма);  
	КонецЕсли;
		
КонецПроцедуры

Процедура АктивизироватьНачальнуюСтраницу() Экспорт
	
	НачальнаяСтраница = УправлениеТелефониейКлиентПовтИсп.ПолучитьНачальнуюСтраницу();
	Если НЕ НачальнаяСтраница = Неопределено Тогда
		НачальнаяСтраница.Активизировать();		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьНачальнуюСтраницу() Экспорт
	
	ОкнаПриложения = ПолучитьОкна();
	Для каждого Окно Из ОкнаПриложения Цикл
		Если Окно.НачальнаяСтраница Тогда
			Возврат Окно;
		КонецЕсли;
	КонецЦикла;
	
КонецФункции

#КонецОбласти
