&НаКлиенте
Перем РежимСправки;


&НаКлиенте
Процедура пЗакрыть(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура РежимСправки(Команда)
	Элементы.ФормаРежимСправки.Пометка = НЕ Элементы.ФормаРежимСправки.Пометка;
	РежимСправки = Элементы.ФормаРежимСправки.Пометка;
	Элементы.ТДЗаполнениеПараметров.Видимость = Элементы.ФормаРежимСправки.Пометка;
	Элементы.ТДРасчетИпотеки.Видимость = Элементы.ФормаРежимСправки.Пометка;
	Если РежимСправки Тогда
		РежимСправкиНаСервере("Старт");
		//ТДЗаполнениеПараметров.Очистить();
		//ТДЗаполнениеПараметров.Вывести(СформироватьТД("Старт"));
		//ТДРасчетИпотеки.Очистить();
		//ТДРасчетИпотеки.Вывести(СформироватьТД("Старт"));	
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура РежимСправкиНаСервере(ИмяМакета, Очистка = Ложь)
	
	ТДЗаполнениеПараметров.Очистить();
	Если Не Очистка Тогда
		ТДЗаполнениеПараметров.Вывести(СформироватьТД(ИмяМакета));
		Если ИмяМакета = "РасчетИпотеки" Или ИмяМакета = "Старт" Тогда
			ТДРасчетИпотеки.Очистить();
			ТДРасчетИпотеки.Вывести(СформироватьТД(ИмяМакета));	
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры


&НаСервере
Функция СформироватьТД(ИмяМакета)
	
	ТД = Новый ТабличныйДокумент;
	Макет = Обработки.Мультикалькулятор.ПолучитьМакет(ИмяМакета);
	Область = Макет.ПолучитьОбласть("Область");
	ТД.Вывести(Область);
	Возврат ТД;
	
КонецФункции

&НаКлиенте
Процедура ПрограммаКредитования(Команда)
	Если РежимСправки Тогда
		РежимСправкиНаСервере("Программа");

		//ТДЗаполнениеПараметров.Очистить();
		//ТДЗаполнениеПараметров.Вывести(СформироватьТД("Программа"));	
	Иначе
		ОткрытьФорму("Справочник.ПрограммыКредитования.ФормаСписка");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СхемаУсловийСтавки(Команда)
	Если РежимСправки Тогда
		РежимСправкиНаСервере("СхемаУсловийСтавки");
		//ТДЗаполнениеПараметров.Очистить();
		//ТДЗаполнениеПараметров.Вывести(СформироватьТД("СхемаУсловийСтавки"));	
	Иначе
		ОткрытьФорму("Справочник.СхемыУсловийСтавки.ФормаСписка");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УсловияПримененияСтавок(Команда)
	Если РежимСправки Тогда
		РежимСправкиНаСервере("УсловияПримененияСтавок");
		//ТДЗаполнениеПараметров.Очистить();
		//ТДЗаполнениеПараметров.Вывести(СформироватьТД("УсловияПримененияСтавок"));	
	Иначе
		ОткрытьФорму("Документ.УсловияПримененияСтавок.ФормаСписка");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СтопФакторы(Команда)
	Если РежимСправки Тогда
		РежимСправкиНаСервере("СтопФакторы");
		//ТДЗаполнениеПараметров.Очистить();
		//ТДЗаполнениеПараметров.Вывести(СформироватьТД("СтопФакторы"));	
	Иначе
		ОткрытьФорму("Документ.СтопФакторыБанков.ФормаСписка");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВводКоэффициентаПлатежДоход(Команда)
	Если РежимСправки Тогда
		РежимСправкиНаСервере("ВводКоэффициентаПлатежДоход");
		//ТДЗаполнениеПараметров.Очистить();
		//ТДЗаполнениеПараметров.Вывести(СформироватьТД("ВводКоэффициентаПлатежДоход"));	
	Иначе
		ОткрытьФорму("Документ.ВводКоэффициентаПлатежДоход.ФормаСписка");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РасчетИпотеки(Команда)
	Если РежимСправки Тогда
		РежимСправкиНаСервере("РасчетИпотеки");
		//ТДРасчетИпотеки.Очистить();
		//ТДРасчетИпотеки.Вывести(СформироватьТД("РасчетИпотеки"));	
	Иначе
		ОткрытьФорму("Документ.РасчетИпотеки.ФормаСписка");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗначенияПараметров(Команда)
	
	Если РежимСправки Тогда
		РежимСправкиНаСервере("ЗначенияПараметров");
		//ТДЗаполнениеПараметров.Очистить();
		//ТДЗаполнениеПараметров.Вывести(СформироватьТД("ЗначенияПараметров"));	
	Иначе
		ОткрытьФорму("Справочник.ПараметрыПримененияСтавок_Значения.ФормаСписка");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОтчетСтопФакторы(Команда)
	
	Если РежимСправки Тогда
	
	Иначе
		ОткрытьФорму("Отчет.МультикалькуляторСтопФакторы.ФормаОбъекта");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВводУсловийИпотечногоКредитования(Команда)
	Если РежимСправки Тогда
		РежимСправкиНаСервере("", Истина);
		//ТДЗаполнениеПараметров.Очистить();
		//ТДЗаполнениеПараметров.Вывести(СформироватьТД("ВводКоэффициентаПлатежДоход"));	
	Иначе
		ОткрытьФорму("Документ.ВводУсловийИпотечногоКредитования.ФормаСписка");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОтчетПроцентныеСтавки(Команда)
	
	Если РежимСправки Тогда
	
	Иначе
		ОткрытьФорму("Отчет.МультикалькуляторПроцентныеСтавки.Форма.ФормаОтчета");
	КонецЕсли;

КонецПроцедуры

РежимСправки = Ложь;
