
&НаКлиенте
Процедура ОК(Команда)
	Закрыть(ДобавитьКонтактныеДанные());
КонецПроцедуры

&НаСервере
Функция ДобавитьКонтактныеДанные()
	
	ЗначениеВозврат = Неопределено;
	Попытка
		Для каждого Участник Из Участники Цикл			
			Участник.ВидТелефона = ?(Участник.Основной, Справочники.ВидыКонтактнойИнформации.ОсновнойТелефонКлиента, Справочники.ВидыКонтактнойИнформации.ТелефонКлиента);
			Если НЕ ЗначениеЗаполнено(Участник.ВидТелефона) Тогда 
				Продолжить;
			КонецЕсли;						
			УчастникОбъект = Участник.Клиент.ПолучитьОбъект(); //Справочники.Клиенты.СоздатьЭлемент(); //
			Строки = УчастникОбъект.КонтактнаяИнформация.НайтиСтроки(Новый Структура("НомерТелефона, Вид", НомерТелефона, Участник.ВидТелефона));			
			Если Строки.Количество() Тогда
				Продолжить;			
			КонецЕсли;
			Если Участник.ВидТелефона = Справочники.ВидыКонтактнойИнформации.ОсновнойТелефонКлиента Тогда
				УчастникОбъект.ОсновнойТелефон = УправлениеТелефониейКлиентСервер.ПривестиТелефонКВиду(НомерТелефона);				
			КонецЕсли;
			НоваяСтрока = УчастникОбъект.КонтактнаяИнформация.Добавить();
			НоваяСтрока.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
			НоваяСтрока.Вид = Участник.ВидТелефона;
			НоваяСтрока.НомерТелефона = НомерТелефона;
			НоваяСтрока.НомерТелефонаБезКодов = УправлениеТелефониейКлиентСервер.ОбрезатьНомер(НомерТелефона);
			НоваяСтрока.Представление = УправлениеТелефониейКлиентСервер.ПривестиТелефонКВиду(НомерТелефона);
			КонтактнаяИнформацияXDTO = УправлениеКонтактнойИнформациейСлужебный.КонтактнаяИнформацияXDTOПоПредставлению(НоваяСтрока.Представление, Участник.ВидТелефона);
			НоваяСтрока.ЗначенияПолей = УправлениеКонтактнойИнформациейСлужебный.КонтактнаяИнформацияXDTOВXML(КонтактнаяИнформацияXDTO);
			УчастникОбъект.Записать();
			Если УчастникОбъект.Заблокирован() Тогда
				УчастникОбъект.Разблокировать();
			КонецЕсли;
			ЗначениеВозврат = 0;
		КонецЦикла;	
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки;
	
	Возврат ЗначениеВозврат;
	
КонецФункции

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если НЕ Параметры.Свойство("Участники") Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	НомерТелефона = Параметры.НомерТелефона;
	
	Для каждого Участник Из Параметры.Участники Цикл
		НоваяСтрока = Участники.Добавить();
		НоваяСтрока.Клиент = Участник;
		//НоваяСтрока.ВидТелефона = Справочники.ВидыКонтактнойИнформации.ОсновнойТелефонКлиента;
	КонецЦикла;
	
	НовыеЗначения = Новый Массив();
	НовыеЗначения.Добавить(Справочники.ВидыКонтактнойИнформации.ОсновнойТелефонКлиента);
	НовыеЗначения.Добавить(Справочники.ВидыКонтактнойИнформации.ТелефонКлиента);

	//НовыйМассив = Новый Массив();	
	//НовыйПараметр = Новый ПараметрВыбора("Отбор.Ссылка", НовыеЗначения);
	//НовыйМассив.Добавить(НовыйПараметр);
	//
	//НовыйПараметр = Новый ПараметрВыбора("Отбор.ЭтоГруппа", Ложь);
	//НовыйМассив.Добавить(НовыйПараметр);
	//	
	//НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
	//
	//Элементы.УчастникиВидТелефона.ПараметрыВыбора = НовыеПараметры;
	
	Элементы.УчастникиВидТелефона.СписокВыбора.ЗагрузитьЗначения(НовыеЗначения); 
	Элементы.УчастникиВидТелефона.РежимВыбораИзСписка = Истина;
	
КонецПроцедуры
