
Функция ВернутьСтруктуруТаблицы(НастройкиКомпоновкиДанныхХЗ=Неопределено) Экспорт
	
	Если НастройкиКомпоновкиДанныхХЗ = Неопределено Тогда
		НастройкиКомпоновкиДанных = ПолучитьНастройкиКомпоновкиДанных(Ссылка);
	Иначе
		НастройкиКомпоновкиДанных = НастройкиКомпоновкиДанныхХЗ.Получить();
	КонецЕсли;
	пЭлементы = НастройкиКомпоновкиДанных.Отбор.Элементы;

	
	МассивГруппировок = Новый Массив;
	МассивГруппировок(МассивГруппировок, пЭлементы);

	Возврат МассивГруппировок;
	
КонецФункции

Функция ПолучитьНастройкиКомпоновкиДанных(Условие)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Отборы.ХранилищеНастроекКомпоновкиДанных
	|ИЗ
	|	Справочник.СхемыУсловийСтавки КАК Отборы
	|ГДЕ
	|	Отборы.Ссылка = &Условие";
	
	Запрос.УстановитьПараметр("Условие", Условие);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ХранилищеНастроекКомпоновкиДанных.Получить();
	КонецЕсли;  	
	
	Возврат Неопределено;
	
КонецФункции

Процедура МассивГруппировок(МассивГруппировок, пЭлементы)

		
	Для Каждого Стр Из пЭлементы Цикл
		Если ТипЗнч(Стр) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
			ПолучитьЭлементыГруппы(Стр, МассивГруппировок);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПолучитьЭлементыГруппы(знач Группа, МассивГруппировок, МассивЗначений=Неопределено)
	
	Если МассивЗначений = Неопределено Тогда
		МассивЗначений = Новый Массив;
	КонецЕсли;
	
	Для Каждого Стр Из Группа.Элементы Цикл
		Если ТипЗнч(Стр) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
			МассивЗначений = Новый Массив;
			ПолучитьЭлементыГруппы(Стр, МассивГруппировок, МассивЗначений);
		КонецЕсли;
		МассивЗначений.Добавить(Стр.ПравоеЗначение);
	КонецЦикла;
	МассивГруппировок.Добавить(МассивЗначений);	
	
КонецПроцедуры
