
&НаКлиенте
Перем КонтекстВыбора Экспорт;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//++ Юкаев Роман 20171222 ( //Задача 750934
	//Если Параметры.Свойство("УстанавливатьОтборЗаявкиНаСделкуНаСогласовании") Тогда
		//ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Проведен", Истина, 					ВидСравненияКомпоновкиДанных.БольшеИлиРавно, , Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный);
		//ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ДатаОт", 	НачалоДня(ТекущаяДата()), 	ВидСравненияКомпоновкиДанных.БольшеИлиРавно, , Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);						
		//ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ДатаДо", 	КонецДня(ТекущаяДата()), 	ВидСравненияКомпоновкиДанных.МеньшеИлиРавно, , Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);				
		//Если Параметры.Свойство("Проект") Тогда
		//	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Проект", Параметры.Проект, ВидСравненияКомпоновкиДанных.ВСписке, , Ложь, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
		//КонецЕсли;
		//МассивСтатусов = Новый СписокЗначений;
		//МассивСтатусов.Добавить(Перечисления.СтатусыСделки.Согласована);
		//МассивСтатусов.Добавить(Перечисления.СтатусыСделки.СогласованиеЮриста);
		//МассивСтатусов.Добавить(Перечисления.СтатусыСделки.СогласованиеИБ);
		//МассивСтатусов.Добавить(Перечисления.СтатусыСделки.СогласованиеУПН);
		//ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Статус", МассивСтатусов, ВидСравненияКомпоновкиДанных.ВСписке, , Ложь, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
	//КонецЕсли;
	//
	//	Если Параметры.Свойство("Автор") Тогда
	//	 	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Автор", Параметры.Автор, ВидСравненияКомпоновкиДанных.Равно, , Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
	//	КонецЕсли;
	//-- Юкаев Роман 20171222 )
	
	Если Параметры.Свойство("УстанавливатьОтборЗаявкиНаСделкуИзТекущихДел") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ДатаОт", НачалоДня(ТекущаяДата()), ВидСравненияКомпоновкиДанных.БольшеИлиРавно, , Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);							
	КонецЕсли;
	
	//++ Юкаев Роман 20171219 ( //Задача 750934
	УстановитьОтборыДляРабочихСтолов(Параметры);
	//-- Юкаев Роман 20171219 )
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	//Отказ = ЭтоПолноправныйПользователь();	
	//Если Отказ Тогда
	//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Документ создается только на основании запроса");		
	//КонецЕсли;
	
КонецПроцедуры

#Область ОбработчикиСобытийФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПечатьИЛИзУПН(Команда)
	
	ТекСтрока = Элементы.Список.ТекущаяСтрока;
	
	Если ТекСтрока <> Неопределено Тогда
		
		МассивАдресов = ПечатьИзУПННаСервере(ТекСтрока, "ИЛ");
		
		ПечатьДокументаИзУПН(ТекСтрока, МассивАдресов)		
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьКарточкиСделкиИзУПН(Команда)
	
	ТекСтрока = Элементы.Список.ТекущаяСтрока;
	
	Если ТекСтрока <> Неопределено Тогда
		
		МассивАдресов = ПечатьИзУПННаСервере(ТекСтрока, "Сделка");
		
		ПечатьДокументаИзУПН(ТекСтрока, МассивАдресов)	
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПечатьДокументаИзУПН(ТекСтрока, МассивАдресов)
	
	Для каждого АдресТД Из МассивАдресов Цикл
		
		ТабДок 								= ПолучитьИзВременногоХранилища(АдресТД);
		ТабДок.РазмерСтраницы				= "A4";
		
		ИдентификаторПечатнойФормы 			= "Макет";
		МодульУправлениеПечатьюКлиент 		= ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеПечатьюКлиент");     
		КоллекцияПечатныхФорм 				= МодульУправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм(ИдентификаторПечатнойФормы);
		ПечатнаяФорма 						= МодульУправлениеПечатьюКлиент.ОписаниеПечатнойФормы(КоллекцияПечатныхФорм, ИдентификаторПечатнойФормы);
		ПечатнаяФорма.СинонимМакета			= Строка(ТекСтрока);
		ПечатнаяФорма.ТабличныйДокумент 	= ТабДок;
		ПечатнаяФорма.ИмяФайлаПечатнойФормы = Строка(ТекСтрока);			
		
	КонецЦикла;		
	
	ОбластиОбъектов = Новый СписокЗначений;
	МодульУправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм, ОбластиОбъектов);	

КонецПроцедуры


&НаСервереБезКонтекста
Функция ЭтоПолноправныйПользователь()
	Возврат НЕ Пользователи.ЭтоПолноправныйПользователь();
КонецФункции

&НаСервереБезКонтекста
Функция ПечатьИзУПННаСервере(Знач ЗаявкаНаСделку, ТипФормы)
	
	МасСтрок = Новый Массив;
	МасСтрок.Добавить(ЗаявкаНаСделку);
	
	БазаDS = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗаявкаНаСделку, "Проект"), "ПроектБазыДомостроителя");
	
	МассивАдресов = Документы.ЗаявкаНаСделку.ПолучитьАдресТабличногоДокументаНаСервере(МасСтрок, ТипФормы, Строка(ПараметрыСеанса.ТекущийПользователь), БазаDS);
	
	Возврат МассивАдресов; 

КонецФункции

//++ Юкаев Роман 20171225 ( //750934
&НаКлиенте
Процедура ПриПовторномОткрытии()
	
	Если ТипЗнч(КонтекстВыбора) = Тип("Структура") Тогда
		УстановитьОтборыДляРабочихСтолов(КонтекстВыбора);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборыДляРабочихСтолов(Знач ПараметрыОтбора)
	
	Если ПараметрыОтбора.Свойство("ОтборДляМенеджераФилиала") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Проект", 	ПараметрыОтбора.Проект, ВидСравненияКомпоновкиДанных.ВСписке, , Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Автор", 	ПараметрыОтбора.Автор, ВидСравненияКомпоновкиДанных.ВСписке, , Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
	КонецЕсли;
	
	Если ПараметрыОтбора.Свойство("ОтборДляСтаршегоМенеджера") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Проект", 	ПараметрыОтбора.Проект, ВидСравненияКомпоновкиДанных.ВСписке, , Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Автор", 	ПараметрыОтбора.Автор, ВидСравненияКомпоновкиДанных.ВСписке, , Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);		
	КонецЕсли;
	
	Если ПараметрыОтбора.Свойство("ОтборДляЮристов") Тогда
	 	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Проект", 	ПараметрыОтбора.Проект, ВидСравненияКомпоновкиДанных.ВСписке, , Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
		МассивСтатусов = Новый СписокЗначений;
		МассивСтатусов.Добавить(Перечисления.СтатусыСделки.СогласованиеЮриста);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Статус", МассивСтатусов, ВидСравненияКомпоновкиДанных.ВСписке, , Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);			
	КонецЕсли;
	
	Если ПараметрыОтбора.Свойство("Статус") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Статус", 	ПараметрыОтбора.Статус, ВидСравненияКомпоновкиДанных.ВСписке, , Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	КонецЕсли;
	
	Если ПараметрыОтбора.Свойство("Проведен") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Проведен", ПараметрыОтбора.Проведен, ВидСравненияКомпоновкиДанных.Равно, , Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	КонецЕсли;
	
	Если ПараметрыОтбора.Свойство("ДатаОт") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ДатаОт", 	ПараметрыОтбора.ДатаОт, ВидСравненияКомпоновкиДанных.БольшеИлиРавно, , Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
	КонецЕсли;
	
	Если ПараметрыОтбора.Свойство("ДатаОт") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ДатаДо", 	ПараметрыОтбора.ДатаДо, ВидСравненияКомпоновкиДанных.МеньшеИлиРавно, , Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
	КонецЕсли;
	
	Список.КомпоновщикНастроек.ЗагрузитьПользовательскиеНастройки(Новый ПользовательскиеНастройкиКомпоновкиДанных);
	
КонецПроцедуры
//-- Юкаев Роман 20171225 )

#КонецОбласти
