
#Область ОбработчикиСобытийФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	////EXTCODE Шумилин Сергей 20.04.2018 {{ ---> 807357
	//Перем ЗначениеПараметра;
	//
	//Если Параметры.Свойство("ВызовИзМК", ЗначениеПараметра) Тогда
	//	
	//	Запрос = Новый Запрос;
	//	Запрос.Текст = 
	//	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	//	|	УсловияМаркетинговойКампанииСрезПоследних.ОбъектСтроительства
	//	|ИЗ
	//	|	РегистрСведений.УсловияМаркетинговойКампании.СрезПоследних(, МаркетинговаяКампания = &МаркетинговаяКомпания) КАК УсловияМаркетинговойКампанииСрезПоследних";
	//	
	//	Запрос.УстановитьПараметр("МаркетинговаяКомпания", Параметры.МаркетинговаяКомпания);
	//	РезультатЗапроса = Запрос.Выполнить();
	//	
	//	Если НЕ РезультатЗапроса.Пустой() Тогда  
	//		
	//		ДанныеВыбора 			= Новый СписокЗначений;
	//		ДанныеВыбора.ЗагрузитьЗначения(РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("ОбъектСтроительства"));
	//        ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,
	//                                    "Ссылка", ДанныеВыбора, ВидСравненияКомпоновкиДанных.ВСписке, "Отбор по ОС", Истина);
	//	
	//	КонецЕсли;
	//	
	//КонецЕсли;
	////EXTCODE Шумилин Сергей 20.04.2018 <--- }} 
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти