
////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ


&НаКлиенте
Процедура ПодборПроектов(Команда)
	
	ПараметрыФормыПодбора = Новый Структура("УИДФормыВладельца", ЭтаФорма.УникальныйИдентификатор);
	ОткрытьФорму("Документ.УсловияКредитования.Форма.ФормаПодбораПроектов", ПараметрыФормыПодбора, Элементы.Проекты);	
	
КонецПроцедуры

&НаКлиенте
Процедура ПроектыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ЭтоАдресВременногоХранилища(ВыбранноеЗначение) Тогда
		ЗагрузитьНаСервере(ВыбранноеЗначение);
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНаСервере(Знач ВыбранноеЗначение)
		
	ТЗ_Проектов = ПолучитьИзВременногоХранилища(ВыбранноеЗначение);
	
	Для каждого СтрокаТЗ Из ТЗ_Проектов Цикл
		Если Объект.Проекты.НайтиСтроки(Новый Структура("Проект", СтрокаТЗ.Проект)).Количество() > 0 Тогда
			Продолжить;	
		КонецЕсли;
		НоваяСтрока = Объект.Проекты.Добавить();	
		НоваяСтрока.Проект = СтрокаТЗ.Проект;
	КонецЦикла;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ УПРАВЛЕНИЯ ВНЕШНИМ ВИДОМ ФОРМЫ

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНДНЫХ ПАНЕЛЕЙ ФОРМЫ

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ОБРАБОТКИ СВОЙСТВ И КАТЕГОРИЙ

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ РЕКВИЗИТОВ ШАПКИ

////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ
