
#Область ПрограммныйИнтерфейс

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если ВидФормы <> "ФормаОбъекта" Тогда
		Возврат;
	КонецЕсли;	
	
	СтандартнаяОбработка = Ложь;
	
	ВидОперации = Неопределено;
	
	Если Параметры.Свойство("Ключ") Тогда
		ВидОперации = Параметры.Ключ.ВидОперации;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ВидОперации) и Параметры.Свойство("ЗначенияЗаполнения")
		и ТипЗнч(Параметры.ЗначенияЗаполнения) = Тип("Структура") и Параметры.ЗначенияЗаполнения.Свойство("ВидОперации") Тогда
		ВидОперации = Параметры.ЗначенияЗаполнения.ВидОперации;
	КонецЕсли;	
	
	Если Не ЗначениеЗаполнено(ВидОперации) и Параметры.Свойство("ЗначениеКопирования") Тогда
		ВидОперации =  Параметры.ЗначениеКопирования.ВидОперации;	
	КонецЕсли;
			
	Если Не ЗначениеЗаполнено(ВидОперации) Тогда
		ВыбраннаяФорма = "ФормаВыбораВидаОперации";
		Возврат;
	КонецЕсли;
	
	СоотвествиеФормИВидовОпераций 	= ПолучитьСоотвествиеФормИВидовОпераций();
	ВыбраннаяФорма 					= СоотвествиеФормИВидовОпераций[ВидОперации];	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьСоотвествиеФормИВидовОпераций() Экспорт

	СоотвествиеФормИВидовОпераций = Новый Соответствие;
	СоотвествиеФормИВидовОпераций.Вставить(Перечисления.ВидыОперацииБронирования.Бронирование, 			"ФормаДокументаБронирование");
	СоотвествиеФормИВидовОпераций.Вставить(Перечисления.ВидыОперацииБронирования.СнятиеБронирования, 	"ФормаДокументаСнятиеБронирования");
	
	Возврат СоотвествиеФормИВидовОпераций;

КонецФункции // ПолучитьСоотвествиеФормИВидовОпераций()

#КонецОбласти

#Область СтандартныеПодсистемы_ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
// Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
	//Позволяет скрыть служебные реквизиты
	//Настройки.ПриПолученииСлужебныхРеквизитов = Истина;
	
КонецПроцедуры

// Ограничивает видимость реквизитов объекта в отчете по версии.
//
// Параметры:
// Реквизиты - Массив - список имен реквизитов объекта.
//Процедура ПриПолученииСлужебныхРеквизитов(Реквизиты) Экспорт
//    Реквизиты.Добавить("ИмяРеквизита"); // реквизит объекта
//    Реквизиты.Добавить("ИмяТабличнойЧасти.*"); // табличная часть объекта
//КонецПроцедуры

#КонецОбласти 
