
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ Параметры.Ключ.Пустая() Тогда
		УстановитьПривилегированныйРежим(Истина);
	    Password = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(Объект.Ссылка);
	    УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	УстановитьВидимостьПериодов();
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	УстановитьПривилегированныйРежим(Истина);
    ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(ТекущийОбъект.Ссылка, Password);
    УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьПериодов()
	
	Видимость = НЕ Объект.ВидПериода = ПредопределенноеЗначение("Перечисление.ВидыПериодов.Дата");
	Элементы.ПериодНачало.Видимость = Видимость;
	Элементы.ПериодОкончание.Видимость = Видимость;
	 
КонецПроцедуры

&НаКлиенте
Процедура ВидПериодаПриИзменении(Элемент)
	УстановитьВидимостьПериодов();
КонецПроцедуры

