
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Заголовок = Параметры.ЗаголовокФормы; 
	
	Если Параметры.Объект <> Неопределено Тогда        
		Если НЕ Параметры.ПланировкаЭтажа 
			И НЕ Параметры.Объект.ПланировкаКвартиры.Пустая() Тогда
			АдресИзображения = ПолучитьНавигационнуюСсылкуКартинки(Параметры.Объект.ПланировкаКвартиры, УникальныйИдентификатор);
		ИначеЕсли Параметры.ПланировкаЭтажа 
			И НЕ Параметры.Объект.ПланировкаСекции.Пустая() Тогда 
			АдресИзображения = ПолучитьНавигационнуюСсылкуКартинки(Параметры.Объект.ПланировкаСекции, УникальныйИдентификатор);
			//Элементы.АдресИзображения.РазмерКартинки = РазмерКартинки.РеальныйРазмер;
		КонецЕсли;	
	КонецЕсли;		
	
	Если ПустаяСтрока(АдресИзображения) Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПолучитьНавигационнуюСсылкуКартинки(ФайлКартинки, ИдентификаторФормы)
	
	Попытка
		Возврат ПрисоединенныеФайлы.ПолучитьДанныеФайла(ФайлКартинки, ИдентификаторФормы).СсылкаНаДвоичныеДанныеФайла;
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

#КонецОбласти