
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("Владелец")
		И ТипЗнч(Параметры.Владелец) = Тип("ПланВидовХарактеристикСсылка.ВопросыДляАнкетирования")
		И НЕ Параметры.Владелец.Пустая() Тогда
				
				Объект.Владелец = Параметры.Владелец;
		
	Иначе		
		//<590625>, Басаргин (23.12.2016) {
		Если Параметры.Ключ.Пустая() Тогда	
			ТекстСообщения = НСтр("ru = 'Данная форма предназначена для открытия только из формы элемента плана вида характеристик ""Вопросы для анкетирования""'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		//<590625> }
	КонецЕсли;
	
	Если Параметры.Свойство("ТипОтвета") Тогда
		Элементы.ТребуетОткрытогоОтвета.Видимость = (Параметры.ТипОтвета = Перечисления.ТипыОтветовНаВопрос.НесколькоВариантовИз);
	Иначе
		Элементы.ТребуетОткрытогоОтвета.Видимость = (Объект.Владелец.ТипОтвета = Перечисления.ТипыОтветовНаВопрос.НесколькоВариантовИз);
	КонецЕсли;
	
КонецПроцедуры

//<590625>, Басаргин (20.12.2016) {
&НаКлиенте
Процедура ПараметрПечатиПриИзменении(Элемент)
	Объект.ПараметрПечати = СокрЛП(Объект.ПараметрПечати);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если (ЗначениеЗаполнено(Объект.СуффиксПараметраПечати) ИЛИ ЗначениеЗаполнено(Объект.ПрефиксПараметраПечати)) И НЕ Объект.ИпотечныеБанки.Количество() Тогда
		СообщениеПолльзователю = Новый СообщениеПользователю;
		СообщениеПолльзователю.Текст = "Укажите банки, для которых используется суффикс/префикс параметра печати";
		//СообщениеПолльзователю.УстановитьДанные(ЭтотОбъект);
		//СообщениеПолльзователю.ПутьКДанным = "ИпотечныеБанки";
		СообщениеПолльзователю.Сообщить();
		Отказ = Истина;	
	КонецЕсли;
КонецПроцедуры
//<590625> }

#КонецОбласти
