
#Область ОбработчикиСобытийФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыУсловия

&НаКлиенте
Процедура УсловияГруппаОСНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.Условия.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено 
			И ЗначениеЗаполнено(ТекущиеДанные.МаркетинговаяКомпания) Тогда
		СтандартнаяОбработка = Ложь;	
		ПараметрыОткрывамойФормы = Новый Структура("ВызовИзМК, МаркетинговаяКомпания", Истина, ТекущиеДанные.МаркетинговаяКомпания);
		ОткрытьФорму("Справочник.ГруппыОбъектовСтроительства.ФормаВыбора", ПараметрыОткрывамойФормы, Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УсловияОтборНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.Условия.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено 
			И ЗначениеЗаполнено(ТекущиеДанные.МаркетинговаяКомпания) 
			И ЗначениеЗаполнено(ТекущиеДанные.ГруппаОС) Тогда
		СтандартнаяОбработка = Ложь;	
		ПараметрыОткрывамойФормы = Новый Структура("ВызовИзМК, МаркетинговаяКомпания, ОбъектСтроительства", Истина, ТекущиеДанные.МаркетинговаяКомпания, ТекущиеДанные.ГруппаОС);
		ОткрытьФорму("Справочник.Отборы.ФормаВыбора", ПараметрыОткрывамойФормы, Элемент);
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти