#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.Взаимодействия

// Процедура формирует строки списка участников.
//
// Параметры:
//  Контакты  - Массив - массив, содержащий участников взаимодействия.
//
Процедура ЗаполнитьКонтакты(Контакты) Экспорт
	
	Взаимодействия.ЗаполнитьКонтактыДляВстречи(Контакты, Участники);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.Взаимодействия

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступом.ЗаполнитьНаборыЗначенийДоступа.
Процедура ЗаполнитьНаборыЗначенийДоступа(Таблица) Экспорт
	
	ВзаимодействияПереопределяемый.ПриЗаполненииНаборовЗначенийДоступа(ЭтотОбъект, Таблица);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)

	УстановитьДатыПоУмолчанию();
	Взаимодействия.ЗаполнитьРеквизитыПоУмолчанию(ЭтотОбъект, ДанныеЗаполнения);

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Взаимодействия.СформироватьСписокУчастников(ЭтотОбъект);
			
	//<789123>, Басаргин (14.03.2018) {
	CRMСервер.ПередЗаписьюВзаимодействияНаСервере(ЭтотОбъект); 
	//<789123> }
		
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	УстановитьДатыПоУмолчанию();
	Ответственный    = Пользователи.ТекущийПользователь();
	Автор            = Пользователи.ТекущийПользователь();
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	//<коммент>, Басаргин (26.10.2017) {
	//Если ДатаОкончания < ДатаНачала Тогда

	//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
	//		НСтр("ru='Дата окончания не может быть меньше даты начала.'"),
	//		,
	//		"ДатаОкончания",
	//		,
	//		Отказ);

	//КонецЕсли;	
	//<коммент> }
		
	//EXTCODE Шумилин Сергей 30.03.2017 {{ --->
	ИндексЭлементаОписания = ПроверяемыеРеквизиты.Найти("Описание");
	Если ИндексЭлементаОписания <> Неопределено Тогда
		ПроверяемыеРеквизиты.Удалить(ИндексЭлементаОписания);	
	КонецЕсли;	
	ИндексЭлементаОписания = ПроверяемыеРеквизиты.Найти("ДатаНачала");
	Если ИндексЭлементаОписания <> Неопределено Тогда
		ПроверяемыеРеквизиты.Удалить(ИндексЭлементаОписания);	
	КонецЕсли;		
	//EXTCODE Шумилин Сергей 30.03.2017 <--- }} 
		
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Взаимодействия.ПриЗаписиДокумента(ЭтотОбъект);	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьДатыПоУмолчанию()

	ДатаНачала = ТекущаяДатаСеанса();
	ДатаНачала = НачалоЧаса(ДатаНачала) + ?(Минута(ДатаНачала) < 30, 1800, 3600);
	//EXTCODE Шумилин Сергей 30.03.2017 {{ --->
	//ДатаОкончания = ДатаНачала + 1800;
	ДатаОкончания = ДатаНачала;
	//EXTCODE Шумилин Сергей 30.03.2017 <--- }} 

КонецПроцедуры

#КонецОбласти

#КонецЕсли