#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ПриОпределенииНастроекОтчета(НастройкиОтчета, НастройкиВариантов) Экспорт
	
	НастройкиОтчета.ПоказыватьНастройкиДиаграммыНаФормеОтчета = Ложь;
	
	НастройкиОтчета.Вставить("РассчитыватьСуммуЯчеек", Ложь);
	
	//НастройкиОтчета.Вставить("УровеньГруппировкиСтрок", 3);
	
КонецПроцедуры

#КонецОбласти 
	
#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	ОтчетыCRM.ПриКомпоновкеРезультата(КомпоновщикНастроек, СхемаКомпоновкиДанных, ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка);	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
 
#КонецОбласти

ЭтоОтчетCRM = Истина;
#КонецЕсли