

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Строки = Параметры.Строки;
	Колонки = Параметры.Колонки;
	ОбластьИмя = Параметры.ОбластьИмя;
	Строка = "";
	Колонка = "";

	Соответствие = Новый Соответствие;
		
	Для Каждого Стр Из Параметры.ЗначенияПересечения Цикл
		Тип = Стр.Владелец;
		Если Тип = Строки ИЛИ Тип = Колонки Тогда
			Продолжить;
		КонецЕсли;
		
		Массив = Соответствие.Получить(Тип);
		Если Массив = Неопределено Тогда
			Массив = Новый Массив;
		КонецЕсли;
		СтруктураВозврата = Новый Структура("Фактор, Значение");
		СтруктураВозврата.Фактор = Тип;
		СтруктураВозврата.Значение = Стр;
		Массив.Добавить(СтруктураВозврата);
		Соответствие.Вставить(Тип, Массив);
	КонецЦикла;
	ВсеКомбинации = Справочники.СхемыУсловийСтавки.ПолучитьВсеКомбинации(Соответствие);
	
	
	i=1;
	Для Каждого Стр Из ВсеКомбинации Цикл
		СоздатьГруппуНаСервере(Стр,i);
		i=i+1;
	КонецЦикла;
	
	Элементы.Надпись.Заголовок = "" + Колонки + " " + Колонка + " и " + Строки + " " + Строка;
	ЭтаФорма.Заголовок = Элементы.Надпись.Заголовок;
	ЭтаФорма.АвтоЗаголовок = Ложь;
	
	
КонецПроцедуры

  &НаСервере
  Процедура СоздатьГруппуНаСервере(Стр,i)
	 
	 КолонкиТЧ = Стр.Владелец().Колонки;
	 ГруппаТЧ = ТЧ.ПолучитьЭлементы().Добавить();
	 ГруппаТЧ.Редактирование = Истина;
	 ГруппаТЧ.Группа = i;

	 Дерево = Новый ДеревоЗначений;
	 Дерево.Колонки.Добавить("Параметр",,"Параметр");
	 Дерево.Колонки.Добавить("Значение",,"Значение");
	 Дерево.Строки.Добавить();
	 
	 НаименованиеГруппы = "";
	 
	 
	 Для Каждого Колонка Из КолонкиТЧ Цикл
	 СтрокаТЧ = ГруппаТЧ.ПолучитьЭлементы().Добавить();	 
	 СтрокаТЧ.Параметр = Стр[Колонка.Имя];
	 СтрокаТЧ.Тип = Стр[Колонка.Имя].Владелец;
	 НаименованиеГруппы = НаименованиеГруппы + ?(НаименованиеГруппы="", "", " И ") 
	 + СтрокаТЧ.Тип.Наименование + "=""" + СтрокаТЧ.Параметр.Наименование+"""";
	 КонецЦикла;
 
 	 ГруппаТЧ.Параметр = НаименованиеГруппы;

	 	 
 КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	ПеренестиЗначенияНаСервере();
	ЭтаФорма.Закрыть();
	 
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиЗначенияНаСервере()
	
	ЭлементыТЧ = ТЧ.ПолучитьЭлементы();
	
	Для Каждого Группа Из ЭлементыТЧ Цикл
		СоставГруппы = Группа.ПолучитьЭлементы();
		Для Каждого Стр Из СоставГруппы Цикл
		ВладелецФормы.ЗаполнитьЗначенияЯчейки(Стр.Тип, Стр.Параметр,ОбластьИмя, Группа.Значение, Группа.Группа);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗначенияСтавок = ВладелецФормы.Объект.ЗначенияСтавок;
	
	ЭлементыТЧ = ТЧ.ПолучитьЭлементы();
	Для Каждого Стр Из ЭлементыТЧ Цикл
	Отбор = Новый Структура("Расположение, Группа", ОбластьИмя, Стр.Группа);
	СтрокиТаблицы = ЗначенияСтавок.НайтиСтроки(Отбор);
	Для Каждого СтрТаб Из СтрокиТаблицы	Цикл
		Стр.Значение = СтрТаб.Ставка;
		Прервать;
	КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ТЧПриАктивизацииСтроки(Элемент)
	
	Если Элемент.ТекущиеДанные.Редактирование Тогда
		Элементы.ТЧ.ТолькоПросмотр = Ложь;
	Иначе
		Элементы.ТЧ.ТолькоПросмотр = Истина;
	КонецЕсли;

КонецПроцедуры



 
