
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
		
	Если ТипЗнч(Данные) = Тип("ДокументСсылка.ВыдачаДисконтныйКарт") Тогда
		Ссылка = Данные;	
	ИначеЕсли ТипЗнч(Данные) = Тип("ДокументОбъект.ВыдачаДисконтныйКарт") Тогда
		Ссылка = Данные.Ссылка;
	ИначеЕсли ТипЗнч(Данные) = Тип("Структура") И Данные.Свойство("Ссылка") Тогда
		Ссылка = Данные.Ссылка;
	Иначе
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;	
	Представление = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "НомерКарты");
	
КонецПроцедуры
