
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Запрос") Тогда
		Запрос = ДанныеЗаполнения;
		ДанныеЗапроса = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеЗаполнения, "Проект, Клиент");
		Проект = ДанныеЗапроса.Проект;
		Получатель = ДанныеЗапроса.Клиент;
		Выгодоприобретатель = ДанныеЗапроса.Клиент;
		Ответственный = Пользователи.ТекущийПользователь();
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		Запрос = ДанныеЗаполнения.Запрос;
		ДанныеЗапроса = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеЗаполнения.Запрос, "Проект, Клиент");
		Проект = ДанныеЗапроса.Проект;
		Если ДанныеЗаполнения.Свойство("Получатель") Тогда
			Получатель = ДанныеЗаполнения.Получатель;
		КонецЕсли;
		Если ДанныеЗаполнения.Свойство("Выгодоприобретатель") Тогда
			Выгодоприобретатель = ДанныеЗаполнения.Выгодоприобретатель;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Получатель) Тогда
			Получатель = ДанныеЗапроса.Клиент;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Выгодоприобретатель) Тогда
			Выгодоприобретатель = ДанныеЗапроса.Клиент;
		КонецЕсли;		
		Ответственный = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
КонецПроцедуры
