
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИпотечныеБанки.Ссылка КАК Банк
	|ИЗ
	|	Справочник.Банки КАК ИпотечныеБанки
	|ГДЕ
	|	НЕ ИпотечныеБанки.Наименование ПОДОБНО ""%отказ%""
	|	И НЕ ИпотечныеБанки.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	ИпотечныеБанки.Наименование";	
	
	СписокБанков.Загрузить(Запрос.Выполнить().Выгрузить());
		
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	
	Для каждого СтрокаТЗ Из СписокБанков Цикл
		СтрокаТЗ.Выбрать = Ложь;	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	
	Для каждого СтрокаТЗ Из СписокБанков Цикл
		СтрокаТЗ.Выбрать = Истина;	
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	
	АдресВХ = ВыгрузитьНаСервере(Параметры.УИДФормыВладельца);
	ОповеститьОВыборе(АдресВХ);	
	
КонецПроцедуры

&НаСервере
Функция ВыгрузитьНаСервере(УИДФормыВладельца)
	
	ТЗ_Банков = СписокБанков.Выгрузить(Новый Структура("Выбрать", Истина), "Банк");
	
	Если ТЗ_Банков.Количество() > 0 Тогда
		АдресВХ = ПоместитьВоВременноеХранилище(ТЗ_Банков, Новый УникальныйИдентификатор(УИДФормыВладельца));
	Иначе
		АдресВХ = "";
	КонецЕсли;
	
	Возврат АдресВХ;
	
КонецФункции

