
#Область ОбработчикиКомандФормы

//<884837>, Басаргин (23.10.2018) {
&НаКлиенте
Процедура НаписатьSMSПоШаблону(Команда)

	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	Предмет = ТекущиеДанные.Ссылка;
	
	Если НЕ ЗначениеЗаполнено(Предмет) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбран предмет взаимодействия. Отправка SMS невозможна.", , , "Предмет");	
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("ВидСообщения, Предмет");
	ПараметрыФормы.ВидСообщения = "СообщениеSMS";
	ПараметрыФормы.Предмет = Предмет;
	ОткрытьФорму("Справочник.ШаблоныСообщений.Форма.СформироватьСообщение", ПараметрыФормы, ЭтаФорма, УникальныйИдентификатор);
	
КонецПроцедуры
//<884837> }

//<852121>, Басаргин (31.10.2018) {
&НаКлиенте
Процедура СоздатьНаОсновании_ВыдачаДисконтныхКарт(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Участники = ПолучитьУчастниковЗапроса(ТекущиеДанные.Ссылка);
	
	Если Участники.Количество() > 1 Тогда
		Клиенты = Новый Массив;
		Для каждого СтрокаУчастник Из Участники Цикл
			Клиенты.Добавить(СтрокаУчастник.Клиент);	
		КонецЦикла;		
		ОткрытьФорму("Документ.ВыдачаДисконтныхКарт.Форма.ФормаВыбораВыгодоприобретателя", Новый Структура("Запрос, Клиенты", ТекущиеДанные.Ссылка, Клиенты), ЭтаФорма, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе
		ОткрытьФорму("Документ.ВыдачаДисконтныхКарт.ФормаОбъекта", Новый Структура("Основание", ТекущиеДанные.Ссылка), ЭтаФорма, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьУчастниковЗапроса(Ссылка) 

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗапросУчастники.Клиент КАК Клиент
		|ИЗ
		|	Документ.Запрос.Участники КАК ЗапросУчастники
		|ГДЕ
		|	ЗапросУчастники.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Клиент");
	
	
КонецФункции
//<852121> }

#КонецОбласти