
//Функция ПолучитьСоставСмены(Ссылка) Экспорт 
//    Запрос = Новый Запрос;
//    Запрос.Текст = "ВЫБРАТЬ " + ?(Ссылка.Пустая(), "ПЕРВЫЕ 0", "") + "
//                   |    НастройкиПользователей.Пользователь КАК Сотрудник
//                   |ИЗ
//                   |    РегистрСведений.НастройкиПользователей КАК НастройкиПользователей
//                   |ГДЕ
//                   |    НастройкиПользователей.Настройка = &Настройка
//                   |    И НастройкиПользователей.Значение = &Значение";
//    Запрос.УстановитьПараметр("Настройка", ПланыВидовХарактеристик.НастройкиПользователей.СменаГПТ);
//    Запрос.УстановитьПараметр("Значение", Ссылка);
//    Возврат Запрос.Выполнить().Выгрузить();
//КонецФункции

//Процедура УдалитьНастройкуПользователя(Сотрудник) Экспорт 
//    
//    НаборЗаписей = РегистрыСведений.НастройкиПользователей.СоздатьНаборЗаписей();
//    НаборЗаписей.Отбор.Настройка.Установить(ПланыВидовХарактеристик.НастройкиПользователей.СменаГПТ);
//    НаборЗаписей.Отбор.Пользователь.Установить(Сотрудник);
//    НаборЗаписей.Прочитать();
//    НаборЗаписей.Очистить();
//    НаборЗаписей.Записать();
//    
//КонецПроцедуры    

//Процедура ДобавитьНастройкуПользователя(Ссылка, Сотрудник) Экспорт 
//    
//    Менеджер = РегистрыСведений.НастройкиПользователей.СоздатьМенеджерЗаписи();
//    Менеджер.Настройка      = ПланыВидовХарактеристик.НастройкиПользователей.СменаГПТ;
//    Менеджер.Значение       = Ссылка;
//    Менеджер.Пользователь   = Сотрудник;
//    Менеджер.Записать();
//    
//КонецПроцедуры    