
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    СписокСменыГПТ.Загрузить(Справочники.Смены.ПолучитьСоставСмены(Объект.Ссылка));
    
    
    // СтандартныеПодсистемы.ВерсионированиеОбъектов
    ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
    // Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
    
    Если Не Отказ Тогда 
        
        ИсходныйСписок =  Справочники.Смены.ПолучитьСоставСмены(ТекущийОбъект.Ссылка);
        Для Каждого ЭлементКоллекции из ИсходныйСписок Цикл 
            Если СписокСменыГПТ.НайтиСтроки(Новый Структура("Сотрудник", ЭлементКоллекции.Сотрудник)).Количество() = 0 Тогда 
                Справочники.Смены.УдалитьНастройкуПользователя(ЭлементКоллекции.Сотрудник);
            КонецЕсли;
        КонецЦикла;
        
        Для Каждого ЭлементКоллекции из СписокСменыГПТ Цикл 
            Если ИсходныйСписок.НайтиСтроки(Новый Структура("Сотрудник", ЭлементКоллекции.Сотрудник)).Количество() = 0 Тогда
                Справочники.Смены.ДобавитьНастройкуПользователя(ТекущийОбъект.Ссылка, ЭлементКоллекции.Сотрудник);    
            КонецЕсли;    
        КонецЦикла;
        
    КонецЕсли;
    
КонецПроцедуры



