
&НаКлиенте
Процедура кнЗакрыть(Команда)
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ТД") Тогда
		ТД = Параметры.ТД;
	Иначе
		НарисоватьТД(ВладелецФормы.Объект.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

//&НаКлиенте
//Процедура ПриОткрытии(Отказ)
//	//ВладелецФормы.Объект
//	НарисоватьТД(ВладелецФормы.Объект.Ссылка);	
//КонецПроцедуры

Процедура НарисоватьТД(СсылкаНаДок)
	Цвет1 = Новый Цвет(255,255,255);
	Цвет2 = Новый Цвет(231, 231, 233);
	
	Макет = Документы.РасчетИпотеки.ПолучитьМакет("ИнфоПоСтопФакторам");
	Область = Макет.ПолучитьОбласть("Шапка");
	ТД.Вывести(Область);
	
	Отбор = Новый Структура("Созаемщик,РезультатГруппы",0, Ложь);
	ПоЗаемщику = СсылкаНаДок.СтопФакторы.Выгрузить().НайтиСтроки(Отбор);
	Если ПоЗаемщику.Количество() > 0 Тогда
		Область = Макет.ПолучитьОбласть("Заемщик");
		ТД.Вывести(Область);
		Область = Макет.ПолучитьОбласть("ПустаяСтрока");
		ТД.Вывести(Область); 
		Область = Макет.ПолучитьОбласть("ШапкаТаблицы");
		ТД.Вывести(Область);
		
		ПредыдущаяГруппа = 0;
		ТекущийЦвет = Цвет1;
		
		Для Каждого Стр Из ПоЗаемщику Цикл
			ТекущаяГруппа = Стр.Группа;
			Если ТекущаяГруппа <> ПредыдущаяГруппа ИЛИ ТекущаяГруппа=0 Тогда
				ТекущийЦвет = ?(ТекущийЦвет=Цвет1, Цвет2, Цвет1);
			КонецЕсли;
			Область = Макет.ПолучитьОбласть("СтрокаТаблицы");
			Область.Область("СтрокаТаблицы").ЦветФона = ТекущийЦвет;
			Область.Область("СтрокаТаблицыОтступ").ЦветФона = Цвет1;
			Область.Параметры.Банк = Стр.Банк;
			Область.Параметры.Причина = "" + Стр.СтопФактор + " = " + Стр.Значение;
			Область.Параметры.ФИО = СсылкаНаДок.ДанныеОЗаемщиках[Стр.Созаемщик].ФИО;
			ТД.Вывести(Область);
			ПредыдущаяГруппа = ТекущаяГруппа;
		КонецЦикла;
	КонецЕсли;

	Отбор = Новый Структура("РезультатГруппы",Ложь);
	ПоВсем = СсылкаНаДок.СтопФакторы.Выгрузить().НайтиСтроки(Отбор);
	ПоСозаемщику = ПоВсем.Количество() - ПоЗаемщику.Количество();

	Если ПоСозаемщику > 0 Тогда
		Область = Макет.ПолучитьОбласть("ПустаяСтрокаШирокая");
		ТД.Вывести(Область); 
		Область = Макет.ПолучитьОбласть("Созаемщики");
		ТД.Вывести(Область);     
		Область = Макет.ПолучитьОбласть("ПустаяСтрока");
		ТД.Вывести(Область); 

		Область = Макет.ПолучитьОбласть("ШапкаТаблицы");
		ТД.Вывести(Область);
		Для Каждого Стр Из ПоВсем Цикл
			Если Стр.Созаемщик = 0 Тогда
				Продолжить;
			КонецЕсли;
			ТекущаяГруппа = Стр.Группа;
			Если ТекущаяГруппа <> ПредыдущаяГруппа ИЛИ ТекущаяГруппа=0 Тогда
				ТекущийЦвет = ?(ТекущийЦвет=Цвет1, Цвет2, Цвет1);
			КонецЕсли;

			Область = Макет.ПолучитьОбласть("СтрокаТаблицы");
			Область.Область("СтрокаТаблицы").ЦветФона = ТекущийЦвет;
			Область.Область("СтрокаТаблицыОтступ").ЦветФона = Цвет1;

			Область.Параметры.Банк = Стр.Банк;
			Область.Параметры.Причина = "" + Стр.СтопФактор + " = " + Стр.Значение;
			Область.Параметры.ФИО = "(Созаемщик " + Стр.Созаемщик + ") " + СсылкаНаДок.ДанныеОЗаемщиках[Стр.Созаемщик].ФИО;
			ТД.Вывести(Область);
			ПредыдущаяГруппа = ТекущаяГруппа;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры