#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.Взаимодействия

// Процедура формирует строки списка участников.
//
// Параметры:
//  Контакты  - Массив - массив структур, описывающих участников взаимодействия.
//
Процедура ЗаполнитьКонтакты(Контакты) Экспорт
	
	Взаимодействия.ЗаполнитьКонтактыДляВстречи(Контакты, Адресаты, Перечисления.ТипыКонтактнойИнформации.Телефон);
	//EXTCODE Шумилин Сергей 03.11.2017 {{ --->
	CRMСервер.СкорректироватьКонтактнуюИнформациюВСМС(ЭтотОбъект);
	//EXTCODE Шумилин Сергей 03.11.2017 <--- }} 
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.Взаимодействия

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступом.ЗаполнитьНаборыЗначенийДоступа.
Процедура ЗаполнитьНаборыЗначенийДоступа(Таблица) Экспорт
	
	ВзаимодействияПереопределяемый.ПриЗаполненииНаборовЗначенийДоступа(ЭтотОбъект, Таблица);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)

	Взаимодействия.ЗаполнитьРеквизитыПоУмолчанию(ЭтотОбъект, ДанныеЗаполнения);

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Тема = ВзаимодействияКлиентСервер.ТемаПоТекстуСообщения(ТекстСообщения);
	Взаимодействия.СформироватьСписокУчастников(ЭтотОбъект);
	
	ПривестиНомерКонтактаК();
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Ответственный    = Пользователи.ТекущийПользователь();
	Автор            = Пользователи.ТекущийПользователь();

	//<814462>, Басаргин (21.05.2018) {
	Состояние = Неопределено;	
	Для каждого СтрокаАдресат Из Адресаты Цикл
		СтрокаАдресат.СостояниеСообщения = Перечисления.СостоянияСообщенияSMS.Исходящее;
		СтрокаАдресат.СтоимостьДоставки = 0;
		СтрокаАдресат.ИдентификаторСообщения = "";
	КонецЦикла;	
	//<814462> }
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	ДобавитьДвиженияВоВспомогательныеРегистры();
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Взаимодействия.ПриЗаписиДокумента(ЭтотОбъект);
	
	////++ Юкаев Роман 20180206 ( //773149
	//ДобавитьДвиженияВоВспомогательныеРегистры();
	////-- Юкаев Роман 20180206 )
	
КонецПроцедуры

#КонецОбласти

//++ Юкаев Роман 20180206 ( //773149
Процедура ДобавитьДвиженияВоВспомогательныеРегистры()
	
	ТекущаяДата = ТекущаяДата();
	
	НЗ = РегистрыСведений.ОтправленныеСМС.СоздатьНаборЗаписей();
	НЗ.Отбор.СообщениеСМС.Установить(ЭтотОбъект.Ссылка);
	
	Запись = НЗ.Добавить();
	
	Запись.СообщениеСМС = ЭтотОбъект.Ссылка;
	Запись.ДатаСозадния = ЭтотОбъект.Дата;
	Запись.КогдаОтправить = ЭтотОбъект.ДатаКогдаОтправить;
	Запись.КонтактыСтрокой = ЭтотОбъект.СписокУчастников;
	Запись.МаркетинговоеМероприятие = ЭтотОбъект.МаркетинговоеМероприятие;
	Запись.НомерДокумента = ЭтотОбъект.Номер;
	Запись.Ответственный = ЭтотОбъект.Ответственный;
	
	Предмет = РегистрыСведений.ПредметыПапкиВзаимодействий.СоздатьНаборЗаписей();
	Предмет.Отбор.Взаимодействие.Установить(ЭтотОбъект.Ссылка);
	Предмет.Прочитать();
	
	Если Предмет.Количество() > 0 Тогда
		Запись.Предмет = Предмет[0].Предмет;
	КонецЕсли;
	
	Запись.Сообщение = ЭтотОбъект.ТекстСообщения;
	Запись.СостояниеОтправки = ЭтотОбъект.Состояние;
	Запись.ДатаИзмененияСтатуса = ТекущаяДата;
	
	Попытка
		НЗ.Записать();
	Исключение
		//ВызватьИсключение;
	КонецПопытки;
	
	НЗ = РегистрыСведений.ПолучателиСМС.СоздатьНаборЗаписей();
	НЗ.Отбор.СообщениеСМС.Установить(ЭтотОбъект.Ссылка);
	
	Для Каждого СтрокаТЧ Из ЭтотОбъект.Адресаты Цикл
		Запись = НЗ.Добавить();
		Запись.СообщениеСМС = ЭтотОбъект.Ссылка;
		Запись.НомерСтр = СтрокаТЧ.НомерСтроки;
		Запись.НомерТелефона = СтрокаТЧ.НомерДляОтправки;
		Запись.Получатель = СтрокаТЧ.Контакт;
		Запись.Состояние = СтрокаТЧ.СостояниеСообщения;
		Запись.ДатаИзмененияСостояния = ТекущаяДата;
		Запись.СтоимостьДоставки = СтрокаТЧ.СтоимостьДоставки;
	КонецЦикла;
	
	Попытка
		НЗ.Записать();
	Исключение
		//ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры
//-- Юкаев Роман 20180206 )

//++ Юкаев Роман 20180319 (//

Процедура ПривестиНомерКонтактаК()
	
	Для Каждого СтрокаАдресата Из Адресаты Цикл
		СтрокаАдресата.НомерДляОтправки = УправлениеТелефониейКлиентСервер.ТолькоДопустимыеСимволыНомера(СтрокаАдресата.НомерДляОтправки);
	КонецЦикла;
	
КонецПроцедуры
//-- Юкаев Роман 20180319 )

#КонецЕсли