////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

#ЕСЛИ НЕ ВНЕШНЕЕСОЕДИНЕНИЕ ТОГДА

// Обработчик события ПриЗаписи объекта.
//
Процедура ПередЗаписью(Отказ)
	
	Если ЭтотОбъект.ОбменДанными.Загрузка Тогда
		Возврат;			           
	КонецЕсли;  

	Если Не (ВидСкидки = Перечисления.ВидыСкидок.ЗадаетсяВДокументе или ВидСкидки = Перечисления.ВидыСкидок.Комплексная) И Не ЗначениеЗаполнено(РазмерСкидки) Тогда
		ОбменДаннымиСервер.СообщитьОбОшибке("Не задана величина скидки!", Отказ);
	КонецЕсли;
	Если ВидСкидки = Перечисления.ВидыСкидок.Комплексная и Состав.Количество()=0 Тогда 
		ОбменДаннымиСервер.СообщитьОбОшибке("Не указана ни одна скидка в составе!", Отказ);
	КонецЕсли;
	Если ВидСкидки = Перечисления.ВидыСкидок.Комплексная и Состав.Количество()>0 и Состав.НайтиСтроки(новый Структура("Скидка",Справочники.ТипыСкидок.ПустаяСсылка())).Количество()>0 Тогда 
		ОбменДаннымиСервер.СообщитьОбОшибке("В составе есть пустые строки!", Отказ);
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ВидСкидки) Тогда
		ОбменДаннымиСервер.СообщитьОбОшибке("Не указан вид скидки!", Отказ);
	КонецЕсли;
	Если ВидСкидки = Перечисления.ВидыСкидок.Относительная И РазмерСкидки > 100 Тогда
		ОбменДаннымиСервер.СообщитьОбОшибке("Величина относительной скидки не может превышать 100%!", Отказ);
	КонецЕсли;
	//Если ВидСкидки = Перечисления.ВидыСкидок.Абсолютная И Валюта.Пустая() Тогда
	//	ОбменДаннымиСервер.СообщитьОбОшибке("Не задана валюта для абсолютной скидки!", Отказ);
	//КонецЕсли;
	
КонецПроцедуры

Функция СоставИзменили()
	ссылкаКоличество =  Ссылка.Состав.Количество();
	объектКоличество =  ЭтотОбъект.Состав.Количество();
	Если Не ссылкаКоличество = объектКоличество Тогда 
		Возврат истина;
	КонецЕсли;
	Для сч=0 по ссылкаКоличество-1 Цикл 
		Если Не Ссылка.Состав.Получить(сч).Скидка = ЭтотОбъект.Состав.Получить(сч).Скидка Тогда 
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	Возврат Ложь;
КонецФункции

#КОНЕЦЕСЛИ

