
Процедура ПриЗаписи(Отказ, Замещение)
	
	//НаборЗаписей = РегистрыСведений.Квартирограмма.СоздатьНаборЗаписей();
	//
	//НаборЗаписей.Отбор.ОбъектНедвижимости.Установить(ЭтотОбъект[0].ОбъектНедвижимости);
	//НаборЗаписей.Отбор.ОбъектСтроительства.Установить(ДатаЗаписи);
	//
	//НаборЗаписей.Прочитать();
	//
	//Для Каждого Запись Из НаборЗаписей Цикл
	//	
	//	// Чтение и сообщение данных полей записи.	
	//	Сообщить(Строка(Запись.Период) + " " + Строка(Запись.Валюта) + " " + Строка(Запись.Курс));
	//	
	//	// Изменение данных полей записи.
	//	Запись.Курс = 0;
	//	
	//КонецЦикла;	
	//
	//НаборЗаписей.Записать();
	
КонецПроцедуры
