#Область ПрограммныйИнтерфейс

&НаКлиенте
Процедура СоздатьБронирование(Команда)
	ОткрытьФормуНовогоДокументаПоВидуОперации(ПредопределенноеЗначение("Перечисление.ВидыОперацииБронирования.Бронирование"));	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьСнятиеСБронирования(Команда)
	ОткрытьФормуНовогоДокументаПоВидуОперации(ПредопределенноеЗначение("Перечисление.ВидыОперацииБронирования.СнятиеБронирования"));	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОткрытьФормуНовогоДокументаПоВидуОперации(ВидОперации)

	ЗначенияЗаполнения = Новый Структура;
	ЗначенияЗаполнения.Вставить("ВидОперации", ВидОперации);
		
	Если Элементы.Список.ТекущиеДанные <> Неопределено Тогда
		ЗначенияЗаполнения.Вставить("ОснованиеДляСнятияБронирования", Элементы.Список.ТекущиеДанные.Ссылка);	
	КонецЕсли;
	
	Если ЭтотОбъект.ВладелецФормы <> Неопределено 
			И ЭтотОбъект.ВладелецФормы.ИмяФормы = "Документ.Запрос.Форма.ФормаДокумента" Тогда
		
		ЗначенияЗаполнения.Вставить("Клиент",			ЭтотОбъект.ВладелецФормы.Объект.Клиент); 
		ЗначенияЗаполнения.Вставить("ДокументЗапрос",	ЭтотОбъект.ВладелецФормы.Объект.Ссылка); 
		ЗначенияЗаполнения.Вставить("Проект",			ЭтотОбъект.ВладелецФормы.Объект.Проект);
		
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);	
	
	ОткрытьФорму("Документ.Бронирование.ФормаОбъекта", ПараметрыФормы, ЭтаФорма);

КонецПроцедуры // ОткрытьФормуНовогоДокументаПоВидуОперации()

#КонецОбласти



