
#Область ПрограммныйИнтерфейс

Функция ПолучитьПустуюСтруктуруЗвонка() Экспорт
	
	Возврат Новый Структура(
		//Измерения
		"ID_Звонка,
		|ДатаНачалаЗвонка,
		|ВызывающийНомер,
		|ВызываемыйНомер, 
		|Контакт,
		//Ресурсы
		|СостояниеЗвонка, 
		|СтатусЗвонка, 
		|ДлительностьЗвонка,
		|ДлительностьВызова, 
		|ДлительностьРазговора,
		|ПредставлениеНомераТелефона,
		|НомерТелефона,
		|НомерЛинии,
		//Реквизиты
		|Ответственный, 
		|Запрос, 
		|ТипЗвонка,
		|ВидЗвонка,
		|ДатаНачалаРазговора,
		|ДатаПеренаправленияЗвонка,
		|ПеренаправленС,
		|ПеренаправленНа, 
		|ДатаОкончанияЗвонка, 
		|ID_Группы,
		|ID_Перенапраление,
		|UCID,
		|UCID_Перенапраление, 
		|CALLID, 
		|ЭтоВнутреннийВызов,
		|Направление,		
		|ЗаявкаИнициатор,
		|ЗагруженИзAvaya_CMS,
		|ИдентификаторСессииТелефонии,
		|ИдентификаторСеансаТелефонии,
		|Комментарий,
		|CallId_Avaya,		
		|First_CallId,
		|Primary_CallId,		
		//служебные
		|НовыйВызов,	
		|ПерезаписатьКонтакт,		
		|ПерезаписатьЗапрос");
	
КонецФункции

Функция ПривестиТелефонКВиду(ТелефонСтрока) Экспорт 
	
	Попытка
		ТелефонЧисло = Число(ТелефонСтрока);
		Если СтрДлина(ТелефонСтрока)=11 Тогда 
			Возврат Лев(ТелефонСтрока,1)+" ("+Прав(Лев(ТелефонСтрока,4),3)+") "+Лев(Прав(ТелефонСтрока,7),3)+"-"+Лев(Прав(ТелефонСтрока,4),2)+"-"+Прав(ТелефонСтрока,2);
		ИначеЕсли СтрДлина(ТелефонСтрока)=10 Тогда 
			Возврат "("+Прав(Лев(ТелефонСтрока,3),3)+") "+Лев(Прав(ТелефонСтрока,7),3)+"-"+Лев(Прав(ТелефонСтрока,4),2)+"-"+Прав(ТелефонСтрока,2);
		ИначеЕсли СтрДлина(ТелефонСтрока)=7 Тогда 
			Возврат Лев(Прав(ТелефонСтрока,7),3)+"-"+Лев(Прав(ТелефонСтрока,4),2)+"-"+Прав(ТелефонСтрока,2);
		ИначеЕсли СтрДлина(ТелефонСтрока)>11 и Лев(ТелефонСтрока,1) = "+" Тогда 
			Возврат Лев(ТелефонСтрока,2)+" ("+Прав(Лев(ТелефонСтрока,5),3)+") "+Лев(Прав(ТелефонСтрока,СтрДлина(ТелефонСтрока)-5),3)+"-"+Лев(Прав(ТелефонСтрока,СтрДлина(ТелефонСтрока)-8),2)+"-"+Прав(ТелефонСтрока,СтрДлина(ТелефонСтрока)-10);
		Иначе
			Возврат ТелефонСтрока;	
		КонецЕсли;	
	Исключение
		Возврат ТелефонСтрока;
	КонецПопытки;
	
КонецФункции

Функция ПривестиНомерКДлине(НомерТелефона) Экспорт 

	Результат = "";
	Для н = 1 По СтрДлина(НомерТелефона) Цикл
		Если СтрЧислоВхождений("0123456789", Сред(НомерТелефона, н, 1)) > 0 Тогда
	    	Результат = Результат + Сред(НомерТелефона, н, 1);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ?(СтрДлина(Результат) = 10, ("8" + Результат), Результат);	
	
КонецФункции

Функция ОбрезатьНомер(Знач НомерТелефона) Экспорт 
	
	Результат = НомерТелефона;
	Если СтрДлина(НомерТелефона) = 11 И (Сред(НомерТелефона, 1, 1) = "7"  ИЛИ Сред(НомерТелефона, 1, 1) = "8" ) И (Сред(НомерТелефона, 2, 1) = "9" ИЛИ Сред(НомерТелефона, 2, 1) = "4" ИЛИ Сред(НомерТелефона, 2, 1) = "3") Тогда
		Результат = Прав(НомерТелефона, СтрДлина(НомерТелефона) - 1);
	ИначеЕсли СтрДлина(НомерТелефона) = 12 И Сред(НомерТелефона, 1, 1) = "9" И Сред(НомерТелефона, 2, 1) = "8" Тогда
		Результат = Прав(НомерТелефона, СтрДлина(НомерТелефона) - 2);		
	КонецЕсли;		
	
	Возврат Результат;	
	
КонецФункции

Функция ФорматироватьТелефон(тел) Экспорт
	
	резт = "";
	Для а=1 по СтрДлина(тел) Цикл
		Если Найти("0123456789", Сред(тел,а,1))>0 Тогда
			резт = резт + Сред(тел,а,1);
		КонецЕсли;
	КонецЦикла;
	Если СтрДлина(резт)=22 Тогда
		резт = лев(резт,11);
	ИначеЕсли СтрДлина(резт)=20 ИЛИ СтрДлина(резт)=10 Тогда
		резт = "7"+лев(резт,10);
	ИначеЕсли СтрДлина(резт) = 12 И Сред(резт, 1, 1) = "9" И Сред(резт, 2, 1) = "8" Тогда
		резт = Прав(резт, СтрДлина(резт) - 1);
	ИначеЕсли СтрДлина(резт) = 11 И Сред(резт, 1, 1) = "7" И (Сред(резт, 2, 1) = "9" ИЛИ Сред(резт, 2, 1) = "4" ИЛИ Сред(резт, 2, 1) = "3") Тогда 
		резт = "8"+Прав(резт, СтрДлина(резт) - 1);
	//ИначеЕсли СтрДлина(резт) = 11 И Сред(тел, 1, 1) = "8" И (Сред(тел, 2, 1) = "9" ИЛИ Сред(тел, 2, 1) = "4" ИЛИ Сред(тел, 2, 1) = "3") Тогда 
	//	резт = "7"+Прав(тел, СтрДлина(резт) - 1);
	Иначе
		резт = СокрЛП(резт);
	КонецЕсли;	
	
	Возврат резт;	
	
КонецФункции

Функция ТолькоДопустимыеСимволыНомера(СтрокаПроверки) Экспорт
	
	Стр = "";
    Для а = 1 По СтрДлина(СтрокаПроверки) Цикл
        КодСимвола = КодСимвола(Сред(СтрокаПроверки, а, 1));
        Цифра = Сред(СтрокаПроверки, а, 1);
        Если ((КодСимвола >= 48 И КодСимвола <= 57) ИЛИ КодСимвола = 42 ) Тогда
            Стр = Стр + Цифра;
        КонецЕсли; 
	КонецЦикла; 
	
	Возврат Стр;
	
КонецФункции

Функция АнализВызываемогоНомера(Знач НомерТелефона) Экспорт
	
	_НомерТелефона = НомерТелефона;
	Если (СтрДлина(_НомерТелефона) = 11 ИЛИ СтрДлина(_НомерТелефона) = 12) И НЕ (Сред(_НомерТелефона, 1, 1) = "7" ИЛИ Сред(_НомерТелефона, 1, 1) = "8") Тогда 
		_НомерТелефона = "9810" + _НомерТелефона;
	ИначеЕсли СтрДлина(_НомерТелефона) = 11 И Сред(_НомерТелефона, 1, 1) = "8" Тогда
		_НомерТелефона = "9" + _НомерТелефона;
	ИначеЕсли СтрДлина(_НомерТелефона) = 11 И Сред(_НомерТелефона, 1, 1) = "7" Тогда
		_НомерТелефона = "98" + Прав(_НомерТелефона, СтрДлина(_НомерТелефона) - 1);	
	КонецЕсли;
	
	Возврат _НомерТелефона;  //MakeCall 981037455216871 Ok!
	
КонецФункции 

Функция УдалениеЛидирующихНулейВНомере(НомерСтрокой) Экспорт
	
	Если ЗначениеЗаполнено(НомерСтрокой) Тогда
		НомерБезНулей = СокрЛП(НомерСтрокой);
		Пока Лев(НомерБезНулей, 1) = "0" Цикл
			НомерБезНулей = Сред(НомерБезНулей, 2);
		КонецЦикла;	
		Возврат НомерБезНулей;
	Иначе	
		Возврат НомерСтрокой;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НомерТелефонаСодержитНедопустимыеСимволы(Знач СтрокаПроверки)
	
	СписокДопустимыхСимволов = Новый Соответствие;
	СписокДопустимыхСимволов.Вставить("+", "+");
	СписокДопустимыхСимволов.Вставить("-", "-");
	СписокДопустимыхСимволов.Вставить(".", ".");
	СписокДопустимыхСимволов.Вставить(",", ",");
	СписокДопустимыхСимволов.Вставить("(", "(");
	СписокДопустимыхСимволов.Вставить(")", ")");
	СписокДопустимыхСимволов.Вставить(" ", " ");
	СписокДопустимыхСимволов.Вставить("w", "w");
	СписокДопустимыхСимволов.Вставить("p", "p");
	СписокДопустимыхСимволов.Вставить("1", "1");
	СписокДопустимыхСимволов.Вставить("2", "2");
	СписокДопустимыхСимволов.Вставить("3", "3");
	СписокДопустимыхСимволов.Вставить("4", "4");
	СписокДопустимыхСимволов.Вставить("5", "5");
	СписокДопустимыхСимволов.Вставить("6", "6");
	СписокДопустимыхСимволов.Вставить("7", "7");
	СписокДопустимыхСимволов.Вставить("8", "8");
	СписокДопустимыхСимволов.Вставить("9", "9");
	СписокДопустимыхСимволов.Вставить("0", "0");
	
	Для НомерСимвола = 1 По СтрДлина(СтрокаПроверки) Цикл
		Символ = Сред(СтрокаПроверки, НомерСимвола, 1);
		Если СписокДопустимыхСимволов.Получить(Символ) = Неопределено Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
КонецФункции

Функция ТолькоЦифры(Строка)
	
	ОбработаннаяСтрока = "";
	
	Для НомерСимвола = 1 По СтрДлина(Строка) Цикл
		Символ = Сред(Строка, НомерСимвола, 1);
		Если Символ >= "0" И Символ <= "9" Тогда
			ОбработаннаяСтрока = ОбработаннаяСтрока + Символ;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ОбработаннаяСтрока;
	
КонецФункции

#КонецОбласти
