
&НаСервере
Процедура ОтправитьНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура Отправить(Команда)
	ОтправитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("РезультатПодбора") Тогда
		РезультатПодбора = Параметры.РезультатПодбора;		
	КонецЕсли;
	
	Если Параметры.Свойство("КлиентыЗапроса") Тогда
		Для каждого Элемент Из Параметры.КлиентыЗапроса Цикл
			НоваяСтрока = КлиентыЗапроса.Добавить();
			НоваяСтрока.Клиент = Элемент.Значение;
			НоваяСтрока.Email = ПолучитьEmailКлиента(Элемент.Значение);			
		КонецЦикла;
	КонецЕсли;	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьEmailКлиента(Клиент)
	
	Email = УправлениеТелефониейСервер.ПолучитьКонтактныеДанныеКлиента(Клиент).Email;
	
	
КонецФункции