
Процедура ПриЗаписи(Отказ)
	ЛогТекущееЗначение = ТекущееЗначениеКонстанты();
	Если ЭтотОбъект.Значение = ЛогТекущееЗначение Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяДата = ТекущаяДата();
	ТекущееЗначение = ЭтотОбъект.Значение;
	МенеджерЗаписи = РегистрыСведений.Лог_ЗапретРедактированияДокументовВыдачиПодарков.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Дата = ТекущаяДата;
	МенеджерЗаписи.ТекущееЗначение = ТекущееЗначение;
	МенеджерЗаписи.ПредыдущееЗначение = ЛогТекущееЗначение;
	Если ОбменДанными.Загрузка Тогда
		МенеджерЗаписи.Событие = "Загрузка даты из УТ";
	Иначе
		МенеджерЗаписи.Событие = "Изменение даты запрета редактирования";
	КонецЕсли;
	МенеджерЗаписи.Пользователь = Пользователи.ТекущийПользователь();
	МенеджерЗаписи.Записать(Ложь);
КонецПроцедуры

Функция ТекущееЗначениеКонстанты()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Лог_ЗапретРедактированияДокументовВыдачиПодарков.ТекущееЗначение
		|ИЗ
		|	РегистрСведений.Лог_ЗапретРедактированияДокументовВыдачиПодарков КАК Лог_ЗапретРедактированияДокументовВыдачиПодарков
		|
		|УПОРЯДОЧИТЬ ПО
		|	Лог_ЗапретРедактированияДокументовВыдачиПодарков.Дата УБЫВ";

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.ТекущееЗначение;
	КонецЦикла;
	
КонецФункции

