
&НаКлиенте 
Перем ЗакрытиеФормы;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//<892472>, Басаргин (02.11.2018) {	
	Если Параметры.Свойство("ВыборИзДисконтнойКарты") Тогда	
		//ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ДатаКонца", НачалоДня(ТекущаяДата()), ВидСравненияКомпоновкиДанных.БольшеИлиРавно, , Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ВыдачаДисконтныхКарт", Истина, ВидСравненияКомпоновкиДанных.Равно, , Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ТретьеЛицо", Ложь, ВидСравненияКомпоновкиДанных.Равно, , Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(Список, "ИспользуетсяВОтчетах");		
	КонецЕсли;
	//<892472> }
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриИзменении(Элемент)
		
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	ЗакрытиеФормы = Истина;
	Закрыть(Новый Структура("МК", Элементы.Список.ТекущаяСтрока));
		
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если НЕ ЗавершениеРаботы Тогда
		Если ТипЗнч(ЗакрытиеФормы) = Тип("Булево") И ЗакрытиеФормы Тогда
  	  		Возврат;
		КонецЕсли;
		ТекущиеДанные = Элементы.Список.ТекущиеДанные;
		Если ТекущиеДанные = Неопределено Тогда
			Возврат;	
		КонецЕсли;	
		СтандартнаяОбработка = Ложь;
		ЗакрытиеФормы = Истина;
		Закрыть(Новый Структура("МК", Элементы.Список.ТекущаяСтрока));			
	КонецЕсли;	
		
КонецПроцедуры
