
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ПараметрыФормы = Новый Структура("Отбор", Новый Структура("Запрос", ПолучитьЗаявку(ПараметрКоманды)));
	ОткрытьФорму("РегистрСведений.ИпотечныйСтатусКлиента.ФормаСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
КонецПроцедуры

&НаСервере
Функция ПолучитьЗаявку(Док)
	Возврат Док.Запрос;
КонецФункции