Процедура ЗаменитьНастройкиТелефонов(новыеНастройки) Экспорт
	СтруктураРеквизитов = Новый Структура();
	Если новыеНастройки.Свойство("SipСервер") Тогда
		СтруктураРеквизитов.Вставить("Сервер",новыеНастройки.SipСервер);
	КонецЕсли;
	Если новыеНастройки.Свойство("СерверЛицензий") Тогда
		СтруктураРеквизитов.Вставить("СерверЛицензий",новыеНастройки.СерверЛицензий);
	КонецЕсли;
	Если новыеНастройки.Свойство("SipТипХранилищаЗаписей") Тогда
		СтруктураРеквизитов.Вставить("ТипХранилищаЗаписей",новыеНастройки.SipТипХранилищаЗаписей);
	КонецЕсли;	
	Если новыеНастройки.Свойство("SipПутьКЛичнойПапкеЗаписей") Тогда
		СтруктураРеквизитов.Вставить("ПутьКЛичнойПапкеЗаписей",новыеНастройки.SipПутьКЛичнойПапкеЗаписей);
	КонецЕсли;	
	Если новыеНастройки.Свойство("SipПутьКОбщейПапкеЗаписей") Тогда
		СтруктураРеквизитов.Вставить("ПутьКОбщейПапкеЗаписей",новыеНастройки.SipПутьКОбщейПапкеЗаписей);
	КонецЕсли;		
	Если новыеНастройки.Свойство("SipТипФайлаЗаписей") Тогда
		СтруктураРеквизитов.Вставить("ТипФайлаЗаписей",новыеНастройки.SipТипФайлаЗаписей);
	КонецЕсли;		
	Если новыеНастройки.Свойство("SipФорматФайлаЗаписей") Тогда
		СтруктураРеквизитов.Вставить("ФорматФайлаЗаписей",новыеНастройки.SipФорматФайлаЗаписей);
	КонецЕсли;			

	Выборка = Справочники.RingoPhone_НастройкиТелефонов.Выбрать();
   	Пока Выборка.Следующий() Цикл
        Объект = Выборка.ПолучитьОбъект();
        ЗаполнитьЗначенияСвойств(Объект,СтруктураРеквизитов);
        Объект.Записать();
    КонецЦикла	
КонецПроцедуры