
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Если ПользователиКлиентСервер.ЭтоСеансВнешнегоПользователя() Тогда
		Отказ = Истина;
	КонецЕсли;
	
	//<590625>, Басаргин (21.12.2016) {
	Вопросы = Новый Массив;
	Фамилия = ПланыВидовХарактеристик.ВопросыДляАнкетирования.НайтиПоРеквизиту("ПараметрПечати", "#Ответ.Фамилия#");
	Если ЗначениеЗаполнено(Фамилия) Тогда
		Вопросы.Добавить(Фамилия);
	КонецЕсли;
	Имя = ПланыВидовХарактеристик.ВопросыДляАнкетирования.НайтиПоРеквизиту("ПараметрПечати", "#Ответ.Имя#");
	Если ЗначениеЗаполнено(Имя) Тогда
		Вопросы.Добавить(Имя);
	КонецЕсли;	
	Отчество = ПланыВидовХарактеристик.ВопросыДляАнкетирования.НайтиПоРеквизиту("ПараметрПечати", "#Ответ.Отчество#");
	Если ЗначениеЗаполнено(Отчество) Тогда
		Вопросы.Добавить(Отчество);
	КонецЕсли;	
	МобильныйТелефон = ПланыВидовХарактеристик.ВопросыДляАнкетирования.НайтиПоРеквизиту("ПараметрПечати", "#Ответ.МобильныйТелефон#");
	Если ЗначениеЗаполнено(МобильныйТелефон) Тогда
		Вопросы.Добавить(МобильныйТелефон);
	КонецЕсли;	
	ДомашнийТелефон = ПланыВидовХарактеристик.ВопросыДляАнкетирования.НайтиПоРеквизиту("ПараметрПечати", "#Ответ.ДомашнийТелефон#");
	Если ЗначениеЗаполнено(ДомашнийТелефон) Тогда
		Вопросы.Добавить(ДомашнийТелефон);
	КонецЕсли;	
	//Список.Параметры.УстановитьЗначениеПараметра("Вопросы", Вопросы);
	Список.Параметры.УстановитьЗначениеПараметра("Фамилия", Фамилия);
	Список.Параметры.УстановитьЗначениеПараметра("Имя", Имя);
	Список.Параметры.УстановитьЗначениеПараметра("Отчество", Отчество);
	Список.Параметры.УстановитьЗначениеПараметра("МобильныйТелефон", МобильныйТелефон);
	Список.Параметры.УстановитьЗначениеПараметра("ДомашнийТелефон", ДомашнийТелефон);
	//<590625> }
	
	//++ Юкаев Роман 20180426 (//811656
	Если Пользователи.РолиДоступны("Администрирование") Тогда
		Элементы.ФормаДокументАнкетаСоздать.Видимость = Истина;
	КонецЕсли;
	//-- Юкаев Роман 20180426 )
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ВерсионированиеОбъектов") Тогда
		МодульВерсионированиеОбъектов = ОбщегоНазначения.ОбщийМодуль("ВерсионированиеОбъектов");
		МодульВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	//Отказ = Истина;
	
КонецПроцедуры

#КонецОбласти
